trol73/avr-make/asm/include/ATxmega8E5def.inc
;*************************************************************************
;** TC - 16-bit Timer/Counter With PWM
;*************************************************************************
.equ TC4_CTRLA_offset = 0x00		// Control  Register A
.equ TC4_CTRLB_offset = 0x01		// Control Register B
.equ TC4_CTRLC_offset = 0x02		// Control register C
.equ TC4_CTRLD_offset = 0x03		// Control Register D
.equ TC4_CTRLE_offset = 0x04		// Control Register E
.equ TC4_CTRLF_offset = 0x05		// Control Register F
.equ TC4_INTCTRLA_offset = 0x06		// Interrupt Control Register A
.equ TC4_INTCTRLB_offset = 0x07		// Interrupt Control Register B
.equ TC4_CTRLGCLR_offset = 0x08		// Control Register G Clear
.equ TC4_CTRLGSET_offset = 0x09		// Control Register G Set
.equ TC4_CTRLHCLR_offset = 0x0A		// Control Register H Clear
.equ TC4_CTRLHSET_offset = 0x0B		// Control Register H Set
.equ TC4_INTFLAGS_offset = 0x0C		// Interrupt Flag Register
.equ TC4_TEMP_offset = 0x0F		// Temporary Register For 16-bit Access
.equ TC4_CNT_offset = 0x20		// Count
.equ TC4_PER_offset = 0x26		// Period
.equ TC4_CCA_offset = 0x28		// Compare or Capture A
.equ TC4_CCB_offset = 0x2A		// Compare or Capture B
.equ TC4_CCC_offset = 0x2C		// Compare or Capture C
.equ TC4_CCD_offset = 0x2E		// Compare or Capture D
.equ TC4_PERBUF_offset = 0x36		// Period Buffer
.equ TC4_CCABUF_offset = 0x38		// Compare Or Capture A Buffer
.equ TC4_CCBBUF_offset = 0x3A		// Compare Or Capture B Buffer
.equ TC4_CCCBUF_offset = 0x3C		// Compare Or Capture C Buffer
.equ TC4_CCDBUF_offset = 0x3E		// Compare Or Capture D Buffer
.equ TC5_CTRLA_offset = 0x00		// Control  Register A
.equ TC5_CTRLB_offset = 0x01		// Control Register B
.equ TC5_CTRLC_offset = 0x02		// Control register C
.equ TC5_CTRLD_offset = 0x03		// Control Register D
.equ TC5_CTRLE_offset = 0x04		// Control Register E
.equ TC5_CTRLF_offset = 0x05		// Control Register F
.equ TC5_INTCTRLA_offset = 0x06		// Interrupt Control Register A
.equ TC5_INTCTRLB_offset = 0x07		// Interrupt Control Register B
.equ TC5_CTRLGCLR_offset = 0x08		// Control Register G Clear
.equ TC5_CTRLGSET_offset = 0x09		// Control Register G Set
.equ TC5_CTRLHCLR_offset = 0x0A		// Control Register H Clear
.equ TC5_CTRLHSET_offset = 0x0B		// Control Register H Set
.equ TC5_INTFLAGS_offset = 0x0C		// Interrupt Flag Register
.equ TC5_TEMP_offset = 0x0F		// Temporary Register For 16-bit Access
.equ TC5_CNT_offset = 0x20		// Count
.equ TC5_PER_offset = 0x26		// Period
.equ TC5_CCA_offset = 0x28		// Compare or Capture A
.equ TC5_CCB_offset = 0x2A		// Compare or Capture B
.equ TC5_PERBUF_offset = 0x36		// Period Buffer
.equ TC5_CCABUF_offset = 0x38		// Compare Or Capture A Buffer
.equ TC5_CCBBUF_offset = 0x3A		// Compare Or Capture B Buffer

;*************************************************************************
;** FAULT - Fault Extension
;*************************************************************************
.equ FAULT_CTRLA_offset = 0x00		// Control A Register
.equ FAULT_CTRLB_offset = 0x01		// Control B Register
.equ FAULT_CTRLC_offset = 0x02		// Control C Register
.equ FAULT_CTRLD_offset = 0x03		// Control D Register
.equ FAULT_CTRLE_offset = 0x04		// Control E Register
.equ FAULT_STATUS_offset = 0x05		// Status Register
.equ FAULT_CTRLGCLR_offset = 0x06		// Control Register G Clear
.equ FAULT_CTRLGSET_offset = 0x07		// Control Register G set

;*************************************************************************
;** WEX - Waveform Extension
;*************************************************************************
.equ WEX_CTRL_offset = 0x00		// Control Register
.equ WEX_DTBOTH_offset = 0x01		// Dead-time Concurrent Write to Both Sides Register
.equ WEX_DTLS_offset = 0x02		// Dead-time Low Side Register
.equ WEX_DTHS_offset = 0x03		// Dead-time High Side Register
.equ WEX_STATUSCLR_offset = 0x04		// Status Clear Register
.equ WEX_STATUSSET_offset = 0x05		// Status Set Register
.equ WEX_SWAP_offset = 0x06		// Swap Register
.equ WEX_PGO_offset = 0x07		// Pattern Generation Override Register
.equ WEX_PGV_offset = 0x08		// Pattern Generation Value Register
.equ WEX_SWAPBUF_offset = 0x0A		// Dead Time Low Side Buffer
.equ WEX_PGOBUF_offset = 0x0B		// Pattern Generation Overwrite Buffer Register
.equ WEX_PGVBUF_offset = 0x0C		// Pattern Generation Value Buffer Register
.equ WEX_OUTOVDIS_offset = 0x0F		// Output Override Disable Register 

;*************************************************************************
;** HIRES - High-Resolution Extension
;*************************************************************************
.equ HIRES_CTRLA_offset = 0x00		// Control Register A

;*************************************************************************
;** USART - Universal Asynchronous Receiver-Transmitter
;*************************************************************************
.equ USART_DATA_offset = 0x00		// Data Register
.equ USART_STATUS_offset = 0x01		// Status Register
.equ USART_CTRLA_offset = 0x02		// Control Register A
.equ USART_CTRLB_offset = 0x03		// Control Register B
.equ USART_CTRLC_offset = 0x04		// Control Register C
.equ USART_CTRLD_offset = 0x05		// Control Register D
.equ USART_BAUDCTRLA_offset = 0x06		// Baud Rate Control Register A
.equ USART_BAUDCTRLB_offset = 0x07		// Baud Rate Control Register B

;*************************************************************************
;** SPI - Serial Peripheral Interface
;*************************************************************************
.equ SPI_CTRL_offset = 0x00		// Control Register
.equ SPI_INTCTRL_offset = 0x01		// Interrupt Control Register
.equ SPI_STATUS_offset = 0x02		// Status Register
.equ SPI_DATA_offset = 0x03		// Data Register
.equ SPI_CTRLB_offset = 0x04		// Control Register B

;*************************************************************************
;** IRCOM - IR Communication Module
;*************************************************************************
.equ IRCOM_CTRL_offset = 0x00		// Control Register
.equ IRCOM_TXPLCTRL_offset = 0x01		// IrDA Transmitter Pulse Length Control Register
.equ IRCOM_RXPLCTRL_offset = 0x02		// IrDA Receiver Pulse Length Control Register

;*************************************************************************
;** FUSE - Fuses and Lockbits
;*************************************************************************
.equ NVM_LOCKBITS_LOCKBITS_offset = 0x00		// Lock Bits
.equ NVM_FUSES_FUSEBYTE1_offset = 0x01		// Watchdog Configuration
.equ NVM_FUSES_FUSEBYTE2_offset = 0x02		// Reset Configuration
.equ NVM_FUSES_FUSEBYTE4_offset = 0x04		// Start-up Configuration
.equ NVM_FUSES_FUSEBYTE5_offset = 0x05		// EESAVE and BOD Level
.equ NVM_FUSES_FUSEBYTE6_offset = 0x06		// Fault State

;*************************************************************************
;** SIGROW - Signature Row
;*************************************************************************
.equ NVM_PROD_SIGNATURES_RCOSC8M_offset = 0x00		// RCOSC 8MHz Calibration Value
.equ NVM_PROD_SIGNATURES_RCOSC32K_offset = 0x02		// RCOSC 32.768 kHz Calibration Value
.equ NVM_PROD_SIGNATURES_RCOSC32M_offset = 0x03		// RCOSC 32 MHz Calibration Value B
.equ NVM_PROD_SIGNATURES_RCOSC32MA_offset = 0x04		// RCOSC 32 MHz Calibration Value A
.equ NVM_PROD_SIGNATURES_LOTNUM0_offset = 0x08		// Lot Number Byte 0, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM1_offset = 0x09		// Lot Number Byte 1, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM2_offset = 0x0A		// Lot Number Byte 2, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM3_offset = 0x0B		// Lot Number Byte 3, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM4_offset = 0x0C		// Lot Number Byte 4, ASCII
.equ NVM_PROD_SIGNATURES_LOTNUM5_offset = 0x0D		// Lot Number Byte 5, ASCII
.equ NVM_PROD_SIGNATURES_WAFNUM_offset = 0x10		// Wafer Number
.equ NVM_PROD_SIGNATURES_COORDX0_offset = 0x12		// Wafer Coordinate X Byte 0
.equ NVM_PROD_SIGNATURES_COORDX1_offset = 0x13		// Wafer Coordinate X Byte 1
.equ NVM_PROD_SIGNATURES_COORDY0_offset = 0x14		// Wafer Coordinate Y Byte 0
.equ NVM_PROD_SIGNATURES_COORDY1_offset = 0x15		// Wafer Coordinate Y Byte 1
.equ NVM_PROD_SIGNATURES_ADCACAL0_offset = 0x20		// ADCA Calibration Byte 0
.equ NVM_PROD_SIGNATURES_ADCACAL1_offset = 0x21		// ADCA Calibration Byte 1
.equ NVM_PROD_SIGNATURES_ACACURRCAL_offset = 0x28		// ACA Current Calibration Byte
.equ NVM_PROD_SIGNATURES_TEMPSENSE0_offset = 0x2E		// Temperature Sensor Calibration Byte 0
.equ NVM_PROD_SIGNATURES_TEMPSENSE1_offset = 0x2F		// Temperature Sensor Calibration Byte 1
.equ NVM_PROD_SIGNATURES_DACA0OFFCAL_offset = 0x30		// DACA0 Calibration Byte 0
.equ NVM_PROD_SIGNATURES_DACA0GAINCAL_offset = 0x31		// DACA0 Calibration Byte 1
.equ NVM_PROD_SIGNATURES_DACA1OFFCAL_offset = 0x34		// DACA1 Calibration Byte 0
.equ NVM_PROD_SIGNATURES_DACA1GAINCAL_offset = 0x35		// DACA1 Calibration Byte 1


; ***** LOCKBIT REGISTER LOCATIONS ***************************************


;*************************************************************************
;** LOCKBIT - Lockbits
;*************************************************************************

.equ LOCKBIT_LOCKBITS = 0		// Lock Bits


; ***** FUSE REGISTER LOCATIONS ******************************************


;*************************************************************************
;** FUSE - NVM_FUSES
;*************************************************************************

.equ FUSE_FUSEBYTE1 = 1		// Watchdog Configuration
.equ FUSE_FUSEBYTE2 = 2		// Reset Configuration
.equ FUSE_FUSEBYTE4 = 4		// Start-up Configuration
.equ FUSE_FUSEBYTE5 = 5		// EESAVE and BOD Level
.equ FUSE_FUSEBYTE6 = 6		// Fault State


