trol73/avr-make/asm/include/ATxmega8E5def.inc
; EDMA_CH_TRIGSRC masks
.equ EDMA_CH_TRIGSRC_gm = 0xFF ; Channel Trigger Source group mask
.equ EDMA_CH_TRIGSRC_gp = 0 ; Channel Trigger Source group position
.equ EDMA_CH_TRIGSRC0_bm = (1<<0) ; Channel Trigger Source bit 0 mask
.equ EDMA_CH_TRIGSRC0_bp = 0 ; Channel Trigger Source bit 0 position
.equ EDMA_CH_TRIGSRC1_bm = (1<<1) ; Channel Trigger Source bit 1 mask
.equ EDMA_CH_TRIGSRC1_bp = 1 ; Channel Trigger Source bit 1 position
.equ EDMA_CH_TRIGSRC2_bm = (1<<2) ; Channel Trigger Source bit 2 mask
.equ EDMA_CH_TRIGSRC2_bp = 2 ; Channel Trigger Source bit 2 position
.equ EDMA_CH_TRIGSRC3_bm = (1<<3) ; Channel Trigger Source bit 3 mask
.equ EDMA_CH_TRIGSRC3_bp = 3 ; Channel Trigger Source bit 3 position
.equ EDMA_CH_TRIGSRC4_bm = (1<<4) ; Channel Trigger Source bit 4 mask
.equ EDMA_CH_TRIGSRC4_bp = 4 ; Channel Trigger Source bit 4 position
.equ EDMA_CH_TRIGSRC5_bm = (1<<5) ; Channel Trigger Source bit 5 mask
.equ EDMA_CH_TRIGSRC5_bp = 5 ; Channel Trigger Source bit 5 position
.equ EDMA_CH_TRIGSRC6_bm = (1<<6) ; Channel Trigger Source bit 6 mask
.equ EDMA_CH_TRIGSRC6_bp = 6 ; Channel Trigger Source bit 6 position
.equ EDMA_CH_TRIGSRC7_bm = (1<<7) ; Channel Trigger Source bit 7 mask
.equ EDMA_CH_TRIGSRC7_bp = 7 ; Channel Trigger Source bit 7 position

; Channel mode
.equ EDMA_CHMODE_PER0123_gc = (0x00<<4) ; Channels 0, 1, 2 and 3 in peripheal conf.
.equ EDMA_CHMODE_STD0_gc = (0x01<<4) ; Channel 0 in standard conf.; channels 2 and 3 in peripheral conf.
.equ EDMA_CHMODE_STD2_gc = (0x02<<4) ; Channel 2 in standard conf.; channels 0 and 1 in peripheral conf.
.equ EDMA_CHMODE_STD02_gc = (0x03<<4) ; Channels 0 and 2 in standard conf.

; Double buffer mode
.equ EDMA_DBUFMODE_DISABLE_gc = (0x00<<2) ; No double buffer enabled
.equ EDMA_DBUFMODE_BUF01_gc = (0x01<<2) ; Double buffer enabled on peripheral channels 0/1 (if exist) 
.equ EDMA_DBUFMODE_BUF23_gc = (0x02<<2) ; Double buffer enabled on peripheral channels 2/3 (if exist)
.equ EDMA_DBUFMODE_BUF0123_gc = (0x03<<2) ; Double buffer enabled on peripheral channels 0/1 and 2/3 or standard channels 0/2

; Priority mode
.equ EDMA_PRIMODE_RR0123_gc = (0x00<<0) ; Round robin on all channels
.equ EDMA_PRIMODE_RR123_gc = (0x01<<0) ; Ch0 > round robin (Ch 1 ch2 Ch3)
.equ EDMA_PRIMODE_RR23_gc = (0x02<<0) ; Ch0 > Ch 1 > round robin (Ch2 Ch3)
.equ EDMA_PRIMODE_CH0123_gc = (0x03<<0) ; Ch0 > Ch1 > Ch2 > Ch3 

; Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch.
.equ EDMA_CH_RELOAD_NONE_gc = (0x00<<4) ; No reload
.equ EDMA_CH_RELOAD_BLOCK_gc = (0x01<<4) ; Reload at end of each block transfer
.equ EDMA_CH_RELOAD_BURST_gc = (0x02<<4) ; Reload at end of each burst transfer
.equ EDMA_CH_RELOAD_TRANSACTION_gc = (0x03<<4) ; Reload at end of each transaction

; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch.
.equ EDMA_CH_DIR_FIXED_gc = (0x00<<0) ; Fixed
.equ EDMA_CH_DIR_INC_gc = (0x01<<0) ; Increment
.equ EDMA_CH_DIR_MP1_gc = (0x04<<0) ; If Peripheral Ch. (Per ==> Mem), 1-byte 'mask-match' (data: ADDRL, mask: ADDRH), else reserved conf. 
.equ EDMA_CH_DIR_MP2_gc = (0x05<<0) ; If Peripheral Ch. (Per ==> Mem), 1-byte 'OR-match' (data-1: ADDRL OR data-2: ADDRH), else reserved conf. 
.equ EDMA_CH_DIR_MP3_gc = (0x06<<0) ; If Peripheral Ch. (Per ==> Mem), 2-byte 'match' (data-1: ADDRL followed by data-2: ADDRH), else reserved conf. 

; Destination addressing mode
.equ EDMA_CH_DESTDIR_FIXED_gc = (0x00<<0) ; Fixed
.equ EDMA_CH_DESTDIR_INC_gc = (0x01<<0) ; Increment
.equ EDMA_CH_DESTDIR_MP1_gc = (0x04<<0) ; 1-byte 'mask-match' (data: ADDRL, mask: ADDRH)
.equ EDMA_CH_DESTDIR_MP2_gc = (0x05<<0) ; 1-byte 'OR-match' (data-1: ADDRL OR data-2: ADDRH)
.equ EDMA_CH_DESTDIR_MP3_gc = (0x06<<0) ; 2-byte 'match' (data1: ADDRL followed by data2: ADDRH)

; Transfer trigger source
.equ EDMA_CH_TRIGSRC_OFF_gc = (0x00<<0) ; Software triggers only
.equ EDMA_CH_TRIGSRC_EVSYS_CH0_gc = (0x01<<0) ; Event CH0 as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_EVSYS_CH1_gc = (0x02<<0) ; Event CH1 as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_EVSYS_CH2_gc = (0x03<<0) ; Event CH2 as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_ADCA_CH0_gc = (0x10<<0) ; ADCA CH0 as trigger
.equ EDMA_CH_TRIGSRC_DACA_CH0_gc = (0x15<<0) ; DACA CH0 as trigger
.equ EDMA_CH_TRIGSRC_DACA_CH1_gc = (0x16<<0) ; DACA CH1 as trigger
.equ EDMA_CH_TRIGSRC_TCC4_OVF_gc = (0x40<<0) ; TCC4 overflow/underflow as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC4_ERR_gc = (0x41<<0) ; TCC4 error as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC4_CCA_gc = (0x42<<0) ; TCC4 compare or capture channel A as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC4_CCB_gc = (0x43<<0) ; TCC4 compare or capture channel B as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC4_CCC_gc = (0x44<<0) ; TCC4 compare or capture channel C as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC4_CCD_gc = (0x45<<0) ; TCC4 compare or capture channel D as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC5_OVF_gc = (0x46<<0) ; TCC5 overflow/underflow as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC5_ERR_gc = (0x47<<0) ; TCC5 error as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC5_CCA_gc = (0x48<<0) ; TCC5 compare or capture channel A as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCC5_CCB_gc = (0x49<<0) ; TCC5 compare or capture channel B as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_SPIC_RXC_gc = (0x4A<<0) ; SPI C transfer complete (SPI Standard Mode) or SPI C receive complete as trigger (SPI Buffer Modes)
.equ EDMA_CH_TRIGSRC_SPIC_DRE_gc = (0x4B<<0) ; SPI C transfer complete (SPI Standard Mode) or SPI C data register empty as trigger (SPI Buffer modes)
.equ EDMA_CH_TRIGSRC_USARTC0_RXC_gc = (0x4C<<0) ; USART C0 receive complete as trigger
.equ EDMA_CH_TRIGSRC_USARTC0_DRE_gc = (0x4D<<0) ; USART C0 data register empty as trigger
.equ EDMA_CH_TRIGSRC_TCD5_OVF_gc = (0x66<<0) ; TCD5 overflow/underflow as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCD5_ERR_gc = (0x67<<0) ; TCD5 error as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCD5_CCA_gc = (0x68<<0) ; TCD5 compare or capture channel A as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_TCD5_CCB_gc = (0x69<<0) ; TCD5 compare or capture channel B as trigger (Standard Channels Only)
.equ EDMA_CH_TRIGSRC_USARTD0_RXC_gc = (0x6C<<0) ; USART D0 receive complete as trigger
.equ EDMA_CH_TRIGSRC_USARTD0_DRE_gc = (0x6D<<0) ; USART D0 data register empty as trigger

; Interrupt level
.equ EDMA_CH_INTLVL_OFF_gc = (0x00<<0) ; Interrupt disabled
.equ EDMA_CH_INTLVL_LO_gc = (0x01<<0) ; Low level
.equ EDMA_CH_INTLVL_MED_gc = (0x02<<0) ; Medium level
.equ EDMA_CH_INTLVL_HI_gc = (0x03<<0) ; High level


;*************************************************************************
;** EVSYS - Event System
;*************************************************************************

; EVSYS_CH0MUX masks
.equ EVSYS_CHMUX_gm = 0xFF ; Event Channel 0 Multiplexer group mask
.equ EVSYS_CHMUX_gp = 0 ; Event Channel 0 Multiplexer group position
.equ EVSYS_CHMUX0_bm = (1<<0) ; Event Channel 0 Multiplexer bit 0 mask
.equ EVSYS_CHMUX0_bp = 0 ; Event Channel 0 Multiplexer bit 0 position
.equ EVSYS_CHMUX1_bm = (1<<1) ; Event Channel 0 Multiplexer bit 1 mask
.equ EVSYS_CHMUX1_bp = 1 ; Event Channel 0 Multiplexer bit 1 position
.equ EVSYS_CHMUX2_bm = (1<<2) ; Event Channel 0 Multiplexer bit 2 mask
.equ EVSYS_CHMUX2_bp = 2 ; Event Channel 0 Multiplexer bit 2 position
.equ EVSYS_CHMUX3_bm = (1<<3) ; Event Channel 0 Multiplexer bit 3 mask
.equ EVSYS_CHMUX3_bp = 3 ; Event Channel 0 Multiplexer bit 3 position
.equ EVSYS_CHMUX4_bm = (1<<4) ; Event Channel 0 Multiplexer bit 4 mask
.equ EVSYS_CHMUX4_bp = 4 ; Event Channel 0 Multiplexer bit 4 position
.equ EVSYS_CHMUX5_bm = (1<<5) ; Event Channel 0 Multiplexer bit 5 mask
.equ EVSYS_CHMUX5_bp = 5 ; Event Channel 0 Multiplexer bit 5 position
.equ EVSYS_CHMUX6_bm = (1<<6) ; Event Channel 0 Multiplexer bit 6 mask
.equ EVSYS_CHMUX6_bp = 6 ; Event Channel 0 Multiplexer bit 6 position
.equ EVSYS_CHMUX7_bm = (1<<7) ; Event Channel 0 Multiplexer bit 7 mask
.equ EVSYS_CHMUX7_bp = 7 ; Event Channel 0 Multiplexer bit 7 position

; EVSYS_CH1MUX masks
; Masks for EVSYS_CHMUX already defined

; EVSYS_CH2MUX masks
; Masks for EVSYS_CHMUX already defined

