trol73/avr-make/asm/include/ATxmega8E5def.inc
; EVSYS_CH3MUX masks
; Masks for EVSYS_CHMUX already defined

; EVSYS_CH4MUX masks
; Masks for EVSYS_CHMUX already defined

; EVSYS_CH5MUX masks
; Masks for EVSYS_CHMUX already defined

; EVSYS_CH6MUX masks
; Masks for EVSYS_CHMUX already defined

; EVSYS_CH7MUX masks
; Masks for EVSYS_CHMUX already defined

; EVSYS_CH0CTRL masks
.equ EVSYS_ROTARY_bm = 0x80 ; Rotary Decoder Enable bit mask
.equ EVSYS_ROTARY_bp = 7 ; Rotary Decoder Enable bit position
.equ EVSYS_QDIRM_gm = 0x60 ; Quadrature Decoder Index Recognition Mode group mask
.equ EVSYS_QDIRM_gp = 5 ; Quadrature Decoder Index Recognition Mode group position
.equ EVSYS_QDIRM0_bm = (1<<5) ; Quadrature Decoder Index Recognition Mode bit 0 mask
.equ EVSYS_QDIRM0_bp = 5 ; Quadrature Decoder Index Recognition Mode bit 0 position
.equ EVSYS_QDIRM1_bm = (1<<6) ; Quadrature Decoder Index Recognition Mode bit 1 mask
.equ EVSYS_QDIRM1_bp = 6 ; Quadrature Decoder Index Recognition Mode bit 1 position
.equ EVSYS_QDIEN_bm = 0x10 ; Quadrature Decoder Index Enable bit mask
.equ EVSYS_QDIEN_bp = 4 ; Quadrature Decoder Index Enable bit position
.equ EVSYS_QDEN_bm = 0x08 ; Quadrature Decoder Enable bit mask
.equ EVSYS_QDEN_bp = 3 ; Quadrature Decoder Enable bit position
.equ EVSYS_DIGFILT_gm = 0x07 ; Digital Filter group mask
.equ EVSYS_DIGFILT_gp = 0 ; Digital Filter group position
.equ EVSYS_DIGFILT0_bm = (1<<0) ; Digital Filter bit 0 mask
.equ EVSYS_DIGFILT0_bp = 0 ; Digital Filter bit 0 position
.equ EVSYS_DIGFILT1_bm = (1<<1) ; Digital Filter bit 1 mask
.equ EVSYS_DIGFILT1_bp = 1 ; Digital Filter bit 1 position
.equ EVSYS_DIGFILT2_bm = (1<<2) ; Digital Filter bit 2 mask
.equ EVSYS_DIGFILT2_bp = 2 ; Digital Filter bit 2 position

; EVSYS_CH1CTRL masks
; Masks for EVSYS_DIGFILT already defined

; EVSYS_CH2CTRL masks
; Masks for EVSYS_DIGFILT already defined

; EVSYS_CH3CTRL masks
; Masks for EVSYS_DIGFILT already defined

; EVSYS_CH4CTRL masks
; Masks for EVSYS_DIGFILT already defined

; EVSYS_CH5CTRL masks
; Masks for EVSYS_DIGFILT already defined

; EVSYS_CH6CTRL masks
; Masks for EVSYS_DIGFILT already defined

; EVSYS_CH7CTRL masks
; Masks for EVSYS_DIGFILT already defined

; EVSYS_DFCTRL masks
.equ EVSYS_PRESCFILT_gm = 0xF0 ; Prescaler Filter group mask
.equ EVSYS_PRESCFILT_gp = 4 ; Prescaler Filter group position
.equ EVSYS_PRESCFILT0_bm = (1<<4) ; Prescaler Filter bit 0 mask
.equ EVSYS_PRESCFILT0_bp = 4 ; Prescaler Filter bit 0 position
.equ EVSYS_PRESCFILT1_bm = (1<<5) ; Prescaler Filter bit 1 mask
.equ EVSYS_PRESCFILT1_bp = 5 ; Prescaler Filter bit 1 position
.equ EVSYS_PRESCFILT2_bm = (1<<6) ; Prescaler Filter bit 2 mask
.equ EVSYS_PRESCFILT2_bp = 6 ; Prescaler Filter bit 2 position
.equ EVSYS_PRESCFILT3_bm = (1<<7) ; Prescaler Filter bit 3 mask
.equ EVSYS_PRESCFILT3_bp = 7 ; Prescaler Filter bit 3 position
.equ EVSYS_FILTSEL_bm = 0x08 ; Prescaler Filter Select bit mask
.equ EVSYS_FILTSEL_bp = 3 ; Prescaler Filter Select bit position
.equ EVSYS_PRESC_gm = 0x07 ; Prescaler group mask
.equ EVSYS_PRESC_gp = 0 ; Prescaler group position
.equ EVSYS_PRESC0_bm = (1<<0) ; Prescaler bit 0 mask
.equ EVSYS_PRESC0_bp = 0 ; Prescaler bit 0 position
.equ EVSYS_PRESC1_bm = (1<<1) ; Prescaler bit 1 mask
.equ EVSYS_PRESC1_bp = 1 ; Prescaler bit 1 position
.equ EVSYS_PRESC2_bm = (1<<2) ; Prescaler bit 2 mask
.equ EVSYS_PRESC2_bp = 2 ; Prescaler bit 2 position

; Event Channel multiplexer input selection
.equ EVSYS_CHMUX_OFF_gc = (0x00<<0) ; Off
.equ EVSYS_CHMUX_RTC_OVF_gc = (0x08<<0) ; RTC Overflow
.equ EVSYS_CHMUX_RTC_CMP_gc = (0x09<<0) ; RTC Compare Match
.equ EVSYS_CHMUX_ACA_CH0_gc = (0x10<<0) ; Analog Comparator A Channel 0
.equ EVSYS_CHMUX_ACA_CH1_gc = (0x11<<0) ; Analog Comparator A Channel 1
.equ EVSYS_CHMUX_ACA_WIN_gc = (0x12<<0) ; Analog Comparator A Window
.equ EVSYS_CHMUX_ADCA_CH0_gc = (0x20<<0) ; ADC A Channel 0
.equ EVSYS_CHMUX_PORTA_PIN0_gc = (0x50<<0) ; Port A, Pin0
.equ EVSYS_CHMUX_PORTA_PIN1_gc = (0x51<<0) ; Port A, Pin1
.equ EVSYS_CHMUX_PORTA_PIN2_gc = (0x52<<0) ; Port A, Pin2
.equ EVSYS_CHMUX_PORTA_PIN3_gc = (0x53<<0) ; Port A, Pin3
.equ EVSYS_CHMUX_PORTA_PIN4_gc = (0x54<<0) ; Port A, Pin4
.equ EVSYS_CHMUX_PORTA_PIN5_gc = (0x55<<0) ; Port A, Pin5
.equ EVSYS_CHMUX_PORTA_PIN6_gc = (0x56<<0) ; Port A, Pin6
.equ EVSYS_CHMUX_PORTA_PIN7_gc = (0x57<<0) ; Port A, Pin7
.equ EVSYS_CHMUX_PORTC_PIN0_gc = (0x60<<0) ; Port C, Pin0
.equ EVSYS_CHMUX_PORTC_PIN1_gc = (0x61<<0) ; Port C, Pin1
.equ EVSYS_CHMUX_PORTC_PIN2_gc = (0x62<<0) ; Port C, Pin2
.equ EVSYS_CHMUX_PORTC_PIN3_gc = (0x63<<0) ; Port C, Pin3
.equ EVSYS_CHMUX_PORTC_PIN4_gc = (0x64<<0) ; Port C, Pin4
.equ EVSYS_CHMUX_PORTC_PIN5_gc = (0x65<<0) ; Port C, Pin5
.equ EVSYS_CHMUX_PORTC_PIN6_gc = (0x66<<0) ; Port C, Pin6
.equ EVSYS_CHMUX_PORTC_PIN7_gc = (0x67<<0) ; Port C, Pin7
.equ EVSYS_CHMUX_PORTD_PIN0_gc = (0x68<<0) ; Port D, Pin0
.equ EVSYS_CHMUX_PORTD_PIN1_gc = (0x69<<0) ; Port D, Pin1
.equ EVSYS_CHMUX_PORTD_PIN2_gc = (0x6A<<0) ; Port D, Pin2
.equ EVSYS_CHMUX_PORTD_PIN3_gc = (0x6B<<0) ; Port D, Pin3
.equ EVSYS_CHMUX_PORTD_PIN4_gc = (0x6C<<0) ; Port D, Pin4
.equ EVSYS_CHMUX_PORTD_PIN5_gc = (0x6D<<0) ; Port D, Pin5
.equ EVSYS_CHMUX_PORTD_PIN6_gc = (0x6E<<0) ; Port D, Pin6
.equ EVSYS_CHMUX_PORTD_PIN7_gc = (0x6F<<0) ; Port D, Pin7
.equ EVSYS_CHMUX_PRESCALER_1_gc = (0x80<<0) ; Prescaler, divide by 1
.equ EVSYS_CHMUX_PRESCALER_2_gc = (0x81<<0) ; Prescaler, divide by 2
.equ EVSYS_CHMUX_PRESCALER_4_gc = (0x82<<0) ; Prescaler, divide by 4
.equ EVSYS_CHMUX_PRESCALER_8_gc = (0x83<<0) ; Prescaler, divide by 8
.equ EVSYS_CHMUX_PRESCALER_16_gc = (0x84<<0) ; Prescaler, divide by 16
.equ EVSYS_CHMUX_PRESCALER_32_gc = (0x85<<0) ; Prescaler, divide by 32
.equ EVSYS_CHMUX_PRESCALER_64_gc = (0x86<<0) ; Prescaler, divide by 64
.equ EVSYS_CHMUX_PRESCALER_128_gc = (0x87<<0) ; Prescaler, divide by 128
.equ EVSYS_CHMUX_PRESCALER_256_gc = (0x88<<0) ; Prescaler, divide by 256
.equ EVSYS_CHMUX_PRESCALER_512_gc = (0x89<<0) ; Prescaler, divide by 512
.equ EVSYS_CHMUX_PRESCALER_1024_gc = (0x8A<<0) ; Prescaler, divide by 1024
.equ EVSYS_CHMUX_PRESCALER_2048_gc = (0x8B<<0) ; Prescaler, divide by 2048
.equ EVSYS_CHMUX_PRESCALER_4096_gc = (0x8C<<0) ; Prescaler, divide by 4096
.equ EVSYS_CHMUX_PRESCALER_8192_gc = (0x8D<<0) ; Prescaler, divide by 8192
.equ EVSYS_CHMUX_PRESCALER_16384_gc = (0x8E<<0) ; Prescaler, divide by 16384
.equ EVSYS_CHMUX_PRESCALER_32768_gc = (0x8F<<0) ; Prescaler, divide by 32768
.equ EVSYS_CHMUX_XCL_UNF0_gc = (0xB0<<0) ; XCL BTC0 underflow
.equ EVSYS_CHMUX_XCL_UNF1_gc = (0xB1<<0) ; XCL BTC1 underflow
.equ EVSYS_CHMUX_XCL_CC0_gc = (0xB2<<0) ; XCL BTC0 capture or compare
.equ EVSYS_CHMUX_XCL_CC1_gc = (0xB3<<0) ; XCL BTC0 capture or compare
.equ EVSYS_CHMUX_XCL_PEC0_gc = (0xB4<<0) ; XCL PEC0 restart
.equ EVSYS_CHMUX_XCL_PEC1_gc = (0xB5<<0) ; XCL PEC1 restart
.equ EVSYS_CHMUX_XCL_LUT0_gc = (0xB6<<0) ; XCL LUT0 output
.equ EVSYS_CHMUX_XCL_LUT1_gc = (0xB7<<0) ; XCL LUT1 output
.equ EVSYS_CHMUX_TCC4_OVF_gc = (0xC0<<0) ; Timer/Counter C4 Overflow
.equ EVSYS_CHMUX_TCC4_ERR_gc = (0xC1<<0) ; Timer/Counter C4 Error
.equ EVSYS_CHMUX_TCC4_CCA_gc = (0xC4<<0) ; Timer/Counter C4 Compare or Capture A
.equ EVSYS_CHMUX_TCC4_CCB_gc = (0xC5<<0) ; Timer/Counter C4 Compare or Capture B
.equ EVSYS_CHMUX_TCC4_CCC_gc = (0xC6<<0) ; Timer/Counter C4 Compare or Capture C
.equ EVSYS_CHMUX_TCC4_CCD_gc = (0xC7<<0) ; Timer/Counter C4 Compare or Capture D
.equ EVSYS_CHMUX_TCC5_OVF_gc = (0xC8<<0) ; Timer/Counter C5 Overflow
.equ EVSYS_CHMUX_TCC5_ERR_gc = (0xC9<<0) ; Timer/Counter C5 Error
.equ EVSYS_CHMUX_TCC5_CCA_gc = (0xCC<<0) ; Timer/Counter C5 Compare or Capture A
.equ EVSYS_CHMUX_TCC5_CCB_gc = (0xCD<<0) ; Timer/Counter C5 Compare or Capture B
.equ EVSYS_CHMUX_TCD5_OVF_gc = (0xD8<<0) ; Timer/Counter D5 Overflow
.equ EVSYS_CHMUX_TCD5_ERR_gc = (0xD9<<0) ; Timer/Counter D5 Error
.equ EVSYS_CHMUX_TCD5_CCA_gc = (0xDC<<0) ; Timer/Counter D5 Compare or Capture A
.equ EVSYS_CHMUX_TCD5_CCB_gc = (0xDD<<0) ; Timer/Counter D5 Compare or Capture B

; Digital filter coefficient
.equ EVSYS_DIGFILT_1SAMPLE_gc = (0x00<<0) ; 1 SAMPLE
.equ EVSYS_DIGFILT_2SAMPLES_gc = (0x01<<0) ; 2 SAMPLES
.equ EVSYS_DIGFILT_3SAMPLES_gc = (0x02<<0) ; 3 SAMPLES
.equ EVSYS_DIGFILT_4SAMPLES_gc = (0x03<<0) ; 4 SAMPLES
.equ EVSYS_DIGFILT_5SAMPLES_gc = (0x04<<0) ; 5 SAMPLES
.equ EVSYS_DIGFILT_6SAMPLES_gc = (0x05<<0) ; 6 SAMPLES
.equ EVSYS_DIGFILT_7SAMPLES_gc = (0x06<<0) ; 7 SAMPLES
.equ EVSYS_DIGFILT_8SAMPLES_gc = (0x07<<0) ; 8 SAMPLES

; Prescaler Filter
.equ EVSYS_PRESCFILT_CH04_gc = (0x01<<4) ; Enable prescaler filter for either channel 0 or 4
.equ EVSYS_PRESCFILT_CH15_gc = (0x08<<4) ; Enable prescaler filter for either channel 1 or 5
.equ EVSYS_PRESCFILT_CH26_gc = (0x40<<4) ; Enable prescaler filter for either channel 2 or 6
.equ EVSYS_PRESCFILT_CH37_gc = (0x3E8<<4) ; Enable prescaler filter for either channel 3 or 7

; Prescaler
.equ EVSYS_PRESCALER_CLKPER_8_gc = (0x00<<0) ; CLKPER, divide by 8
.equ EVSYS_PRESCALER_CLKPER_64_gc = (0x01<<0) ; CLKPER, divide by 64
.equ EVSYS_PRESCALER_CLKPER_512_gc = (0x02<<0) ; CLKPER, divide by 512
.equ EVSYS_PRESCALER_CLKPER_4096_gc = (0x03<<0) ; CLKPER, divide by 4096
.equ EVSYS_PRESCALER_CLKPER_32768_gc = (0x04<<0) ; CLKPER, divide by 32768


;*************************************************************************
;** NVM - Non Volatile Memory Controller
;*************************************************************************

; NVM_CMD masks
.equ NVM_CMD_gm = 0x7F ; Command group mask
.equ NVM_CMD_gp = 0 ; Command group position
.equ NVM_CMD0_bm = (1<<0) ; Command bit 0 mask
.equ NVM_CMD0_bp = 0 ; Command bit 0 position
.equ NVM_CMD1_bm = (1<<1) ; Command bit 1 mask
.equ NVM_CMD1_bp = 1 ; Command bit 1 position
.equ NVM_CMD2_bm = (1<<2) ; Command bit 2 mask
.equ NVM_CMD2_bp = 2 ; Command bit 2 position
.equ NVM_CMD3_bm = (1<<3) ; Command bit 3 mask
.equ NVM_CMD3_bp = 3 ; Command bit 3 position
.equ NVM_CMD4_bm = (1<<4) ; Command bit 4 mask
.equ NVM_CMD4_bp = 4 ; Command bit 4 position
.equ NVM_CMD5_bm = (1<<5) ; Command bit 5 mask
.equ NVM_CMD5_bp = 5 ; Command bit 5 position
.equ NVM_CMD6_bm = (1<<6) ; Command bit 6 mask
.equ NVM_CMD6_bp = 6 ; Command bit 6 position

; NVM_CTRLA masks
.equ NVM_CMDEX_bm = 0x01 ; Command Execute bit mask
.equ NVM_CMDEX_bp = 0 ; Command Execute bit position

; NVM_CTRLB masks
.equ NVM_EPRM_bm = 0x02 ; EEPROM Power Reduction Enable bit mask
.equ NVM_EPRM_bp = 1 ; EEPROM Power Reduction Enable bit position
.equ NVM_SPMLOCK_bm = 0x01 ; SPM Lock bit mask
.equ NVM_SPMLOCK_bp = 0 ; SPM Lock bit position

; NVM_INTCTRL masks
.equ NVM_SPMLVL_gm = 0x0C ; SPM Interrupt Level group mask
.equ NVM_SPMLVL_gp = 2 ; SPM Interrupt Level group position
.equ NVM_SPMLVL0_bm = (1<<2) ; SPM Interrupt Level bit 0 mask
.equ NVM_SPMLVL0_bp = 2 ; SPM Interrupt Level bit 0 position
.equ NVM_SPMLVL1_bm = (1<<3) ; SPM Interrupt Level bit 1 mask
.equ NVM_SPMLVL1_bp = 3 ; SPM Interrupt Level bit 1 position
.equ NVM_EELVL_gm = 0x03 ; EEPROM Interrupt Level group mask
.equ NVM_EELVL_gp = 0 ; EEPROM Interrupt Level group position
.equ NVM_EELVL0_bm = (1<<0) ; EEPROM Interrupt Level bit 0 mask
.equ NVM_EELVL0_bp = 0 ; EEPROM Interrupt Level bit 0 position
.equ NVM_EELVL1_bm = (1<<1) ; EEPROM Interrupt Level bit 1 mask
.equ NVM_EELVL1_bp = 1 ; EEPROM Interrupt Level bit 1 position

; NVM_STATUS masks
.equ NVM_NVMBUSY_bm = 0x80 ; Non-volatile Memory Busy bit mask
.equ NVM_NVMBUSY_bp = 7 ; Non-volatile Memory Busy bit position
.equ NVM_FBUSY_bm = 0x40 ; Flash Memory Busy bit mask
.equ NVM_FBUSY_bp = 6 ; Flash Memory Busy bit position
.equ NVM_EELOAD_bm = 0x02 ; EEPROM Page Buffer Active Loading bit mask
.equ NVM_EELOAD_bp = 1 ; EEPROM Page Buffer Active Loading bit position
.equ NVM_FLOAD_bm = 0x01 ; Flash Page Buffer Active Loading bit mask
.equ NVM_FLOAD_bp = 0 ; Flash Page Buffer Active Loading bit position

; NVM_LOCKBITS masks
.equ NVM_BLBB_gm = 0xC0 ; Boot Lock Bits - Boot Section group mask
.equ NVM_BLBB_gp = 6 ; Boot Lock Bits - Boot Section group position
.equ NVM_BLBB0_bm = (1<<6) ; Boot Lock Bits - Boot Section bit 0 mask
.equ NVM_BLBB0_bp = 6 ; Boot Lock Bits - Boot Section bit 0 position
.equ NVM_BLBB1_bm = (1<<7) ; Boot Lock Bits - Boot Section bit 1 mask
.equ NVM_BLBB1_bp = 7 ; Boot Lock Bits - Boot Section bit 1 position
.equ NVM_BLBA_gm = 0x30 ; Boot Lock Bits - Application Section group mask
.equ NVM_BLBA_gp = 4 ; Boot Lock Bits - Application Section group position
.equ NVM_BLBA0_bm = (1<<4) ; Boot Lock Bits - Application Section bit 0 mask
.equ NVM_BLBA0_bp = 4 ; Boot Lock Bits - Application Section bit 0 position
.equ NVM_BLBA1_bm = (1<<5) ; Boot Lock Bits - Application Section bit 1 mask
.equ NVM_BLBA1_bp = 5 ; Boot Lock Bits - Application Section bit 1 position
.equ NVM_BLBAT_gm = 0x0C ; Boot Lock Bits - Application Table group mask
.equ NVM_BLBAT_gp = 2 ; Boot Lock Bits - Application Table group position
.equ NVM_BLBAT0_bm = (1<<2) ; Boot Lock Bits - Application Table bit 0 mask
.equ NVM_BLBAT0_bp = 2 ; Boot Lock Bits - Application Table bit 0 position
.equ NVM_BLBAT1_bm = (1<<3) ; Boot Lock Bits - Application Table bit 1 mask
.equ NVM_BLBAT1_bp = 3 ; Boot Lock Bits - Application Table bit 1 position
.equ NVM_LB_gm = 0x03 ; Lock Bits group mask
.equ NVM_LB_gp = 0 ; Lock Bits group position
.equ NVM_LB0_bm = (1<<0) ; Lock Bits bit 0 mask
.equ NVM_LB0_bp = 0 ; Lock Bits bit 0 position
.equ NVM_LB1_bm = (1<<1) ; Lock Bits bit 1 mask
.equ NVM_LB1_bp = 1 ; Lock Bits bit 1 position

