trol73/avr-make/asm/include/ATxmega8E5def.inc
; Interupt mode
.equ ADC_CH_INTMODE_COMPLETE_gc = (0x00<<2) ; Interrupt on conversion complete
.equ ADC_CH_INTMODE_BELOW_gc = (0x01<<2) ; Interrupt on result below compare value
.equ ADC_CH_INTMODE_ABOVE_gc = (0x03<<2) ; Interrupt on result above compare value

; Interrupt level
.equ ADC_CH_INTLVL_OFF_gc = (0x00<<0) ; Interrupt disabled
.equ ADC_CH_INTLVL_LO_gc = (0x01<<0) ; Low level
.equ ADC_CH_INTLVL_MED_gc = (0x02<<0) ; Medium level
.equ ADC_CH_INTLVL_HI_gc = (0x03<<0) ; High level

; Averaged Number of Samples
.equ ADC_SAMPNUM_1X_gc = (0x00<<0) ; 1 Sample
.equ ADC_SAMPNUM_2X_gc = (0x01<<0) ; 2 Samples
.equ ADC_SAMPNUM_4X_gc = (0x02<<0) ; 4 Samples
.equ ADC_SAMPNUM_8X_gc = (0x03<<0) ; 8 Samples
.equ ADC_SAMPNUM_16X_gc = (0x04<<0) ; 16 Samples
.equ ADC_SAMPNUM_32X_gc = (0x05<<0) ; 32 Samples
.equ ADC_SAMPNUM_64X_gc = (0x06<<0) ; 64 Samples
.equ ADC_SAMPNUM_128X_gc = (0x07<<0) ; 128 Samples
.equ ADC_SAMPNUM_256X_gc = (0x08<<0) ; 256 Samples
.equ ADC_SAMPNUM_512X_gc = (0x09<<0) ; 512 Samples
.equ ADC_SAMPNUM_1024X_gc = (0x0A<<0) ; 1024 Samples


;*************************************************************************
;** DAC - Digital/Analog Converter
;*************************************************************************

; DAC_CTRLA masks
.equ DAC_IDOEN_bm = 0x10 ; Internal Output Enable bit mask
.equ DAC_IDOEN_bp = 4 ; Internal Output Enable bit position
.equ DAC_CH1EN_bm = 0x08 ; Channel 1 Output Enable bit mask
.equ DAC_CH1EN_bp = 3 ; Channel 1 Output Enable bit position
.equ DAC_CH0EN_bm = 0x04 ; Channel 0 Output Enable bit mask
.equ DAC_CH0EN_bp = 2 ; Channel 0 Output Enable bit position
.equ DAC_LPMODE_bm = 0x02 ; Low Power Mode bit mask
.equ DAC_LPMODE_bp = 1 ; Low Power Mode bit position
.equ DAC_ENABLE_bm = 0x01 ; Enable bit mask
.equ DAC_ENABLE_bp = 0 ; Enable bit position

; DAC_CTRLB masks
.equ DAC_CHSEL_gm = 0x60 ; Channel Select group mask
.equ DAC_CHSEL_gp = 5 ; Channel Select group position
.equ DAC_CHSEL0_bm = (1<<5) ; Channel Select bit 0 mask
.equ DAC_CHSEL0_bp = 5 ; Channel Select bit 0 position
.equ DAC_CHSEL1_bm = (1<<6) ; Channel Select bit 1 mask
.equ DAC_CHSEL1_bp = 6 ; Channel Select bit 1 position
.equ DAC_CH1TRIG_bm = 0x02 ; Channel 1 Event Trig Enable bit mask
.equ DAC_CH1TRIG_bp = 1 ; Channel 1 Event Trig Enable bit position
.equ DAC_CH0TRIG_bm = 0x01 ; Channel 0 Event Trig Enable bit mask
.equ DAC_CH0TRIG_bp = 0 ; Channel 0 Event Trig Enable bit position

; DAC_CTRLC masks
.equ DAC_REFSEL_gm = 0x18 ; Reference Select group mask
.equ DAC_REFSEL_gp = 3 ; Reference Select group position
.equ DAC_REFSEL0_bm = (1<<3) ; Reference Select bit 0 mask
.equ DAC_REFSEL0_bp = 3 ; Reference Select bit 0 position
.equ DAC_REFSEL1_bm = (1<<4) ; Reference Select bit 1 mask
.equ DAC_REFSEL1_bp = 4 ; Reference Select bit 1 position
.equ DAC_LEFTADJ_bm = 0x01 ; Left-adjust Result bit mask
.equ DAC_LEFTADJ_bp = 0 ; Left-adjust Result bit position

; DAC_EVCTRL masks
.equ DAC_EVSPLIT_bm = 0x08 ; Separate Event Channel Input for Channel 1 bit mask
.equ DAC_EVSPLIT_bp = 3 ; Separate Event Channel Input for Channel 1 bit position
.equ DAC_EVSEL_gm = 0x07 ; Event Input Selection group mask
.equ DAC_EVSEL_gp = 0 ; Event Input Selection group position
.equ DAC_EVSEL0_bm = (1<<0) ; Event Input Selection bit 0 mask
.equ DAC_EVSEL0_bp = 0 ; Event Input Selection bit 0 position
.equ DAC_EVSEL1_bm = (1<<1) ; Event Input Selection bit 1 mask
.equ DAC_EVSEL1_bp = 1 ; Event Input Selection bit 1 position
.equ DAC_EVSEL2_bm = (1<<2) ; Event Input Selection bit 2 mask
.equ DAC_EVSEL2_bp = 2 ; Event Input Selection bit 2 position

; DAC_TIMCTRL masks
.equ DAC_CONINTVAL_gm = 0x70 ; Conversion Intercal group mask
.equ DAC_CONINTVAL_gp = 4 ; Conversion Intercal group position
.equ DAC_CONINTVAL0_bm = (1<<4) ; Conversion Intercal bit 0 mask
.equ DAC_CONINTVAL0_bp = 4 ; Conversion Intercal bit 0 position
.equ DAC_CONINTVAL1_bm = (1<<5) ; Conversion Intercal bit 1 mask
.equ DAC_CONINTVAL1_bp = 5 ; Conversion Intercal bit 1 position
.equ DAC_CONINTVAL2_bm = (1<<6) ; Conversion Intercal bit 2 mask
.equ DAC_CONINTVAL2_bp = 6 ; Conversion Intercal bit 2 position
.equ DAC_REFRESH_gm = 0x0F ; Refresh Timing Control group mask
.equ DAC_REFRESH_gp = 0 ; Refresh Timing Control group position
.equ DAC_REFRESH0_bm = (1<<0) ; Refresh Timing Control bit 0 mask
.equ DAC_REFRESH0_bp = 0 ; Refresh Timing Control bit 0 position
.equ DAC_REFRESH1_bm = (1<<1) ; Refresh Timing Control bit 1 mask
.equ DAC_REFRESH1_bp = 1 ; Refresh Timing Control bit 1 position
.equ DAC_REFRESH2_bm = (1<<2) ; Refresh Timing Control bit 2 mask
.equ DAC_REFRESH2_bp = 2 ; Refresh Timing Control bit 2 position
.equ DAC_REFRESH3_bm = (1<<3) ; Refresh Timing Control bit 3 mask
.equ DAC_REFRESH3_bp = 3 ; Refresh Timing Control bit 3 position

; DAC_STATUS masks
.equ DAC_CH1DRE_bm = 0x02 ; Channel 1 Data Register Empty bit mask
.equ DAC_CH1DRE_bp = 1 ; Channel 1 Data Register Empty bit position
.equ DAC_CH0DRE_bm = 0x01 ; Channel 0 Data Register Empty bit mask
.equ DAC_CH0DRE_bp = 0 ; Channel 0 Data Register Empty bit position

; DAC_CH0GAINCAL masks
.equ DAC_CH0GAINCAL_gm = 0x7F ; Gain Calibration group mask
.equ DAC_CH0GAINCAL_gp = 0 ; Gain Calibration group position
.equ DAC_CH0GAINCAL0_bm = (1<<0) ; Gain Calibration bit 0 mask
.equ DAC_CH0GAINCAL0_bp = 0 ; Gain Calibration bit 0 position
.equ DAC_CH0GAINCAL1_bm = (1<<1) ; Gain Calibration bit 1 mask
.equ DAC_CH0GAINCAL1_bp = 1 ; Gain Calibration bit 1 position
.equ DAC_CH0GAINCAL2_bm = (1<<2) ; Gain Calibration bit 2 mask
.equ DAC_CH0GAINCAL2_bp = 2 ; Gain Calibration bit 2 position
.equ DAC_CH0GAINCAL3_bm = (1<<3) ; Gain Calibration bit 3 mask
.equ DAC_CH0GAINCAL3_bp = 3 ; Gain Calibration bit 3 position
.equ DAC_CH0GAINCAL4_bm = (1<<4) ; Gain Calibration bit 4 mask
.equ DAC_CH0GAINCAL4_bp = 4 ; Gain Calibration bit 4 position
.equ DAC_CH0GAINCAL5_bm = (1<<5) ; Gain Calibration bit 5 mask
.equ DAC_CH0GAINCAL5_bp = 5 ; Gain Calibration bit 5 position
.equ DAC_CH0GAINCAL6_bm = (1<<6) ; Gain Calibration bit 6 mask
.equ DAC_CH0GAINCAL6_bp = 6 ; Gain Calibration bit 6 position

; DAC_CH0OFFSETCAL masks
.equ DAC_CH0OFFSETCAL_gm = 0x7F ; Offset Calibration group mask
.equ DAC_CH0OFFSETCAL_gp = 0 ; Offset Calibration group position
.equ DAC_CH0OFFSETCAL0_bm = (1<<0) ; Offset Calibration bit 0 mask
.equ DAC_CH0OFFSETCAL0_bp = 0 ; Offset Calibration bit 0 position
.equ DAC_CH0OFFSETCAL1_bm = (1<<1) ; Offset Calibration bit 1 mask
.equ DAC_CH0OFFSETCAL1_bp = 1 ; Offset Calibration bit 1 position
.equ DAC_CH0OFFSETCAL2_bm = (1<<2) ; Offset Calibration bit 2 mask
.equ DAC_CH0OFFSETCAL2_bp = 2 ; Offset Calibration bit 2 position
.equ DAC_CH0OFFSETCAL3_bm = (1<<3) ; Offset Calibration bit 3 mask
.equ DAC_CH0OFFSETCAL3_bp = 3 ; Offset Calibration bit 3 position
.equ DAC_CH0OFFSETCAL4_bm = (1<<4) ; Offset Calibration bit 4 mask
.equ DAC_CH0OFFSETCAL4_bp = 4 ; Offset Calibration bit 4 position
.equ DAC_CH0OFFSETCAL5_bm = (1<<5) ; Offset Calibration bit 5 mask
.equ DAC_CH0OFFSETCAL5_bp = 5 ; Offset Calibration bit 5 position
.equ DAC_CH0OFFSETCAL6_bm = (1<<6) ; Offset Calibration bit 6 mask
.equ DAC_CH0OFFSETCAL6_bp = 6 ; Offset Calibration bit 6 position

; DAC_CH1GAINCAL masks
.equ DAC_CH1GAINCAL_gm = 0x7F ; Gain Calibration group mask
.equ DAC_CH1GAINCAL_gp = 0 ; Gain Calibration group position
.equ DAC_CH1GAINCAL0_bm = (1<<0) ; Gain Calibration bit 0 mask
.equ DAC_CH1GAINCAL0_bp = 0 ; Gain Calibration bit 0 position
.equ DAC_CH1GAINCAL1_bm = (1<<1) ; Gain Calibration bit 1 mask
.equ DAC_CH1GAINCAL1_bp = 1 ; Gain Calibration bit 1 position
.equ DAC_CH1GAINCAL2_bm = (1<<2) ; Gain Calibration bit 2 mask
.equ DAC_CH1GAINCAL2_bp = 2 ; Gain Calibration bit 2 position
.equ DAC_CH1GAINCAL3_bm = (1<<3) ; Gain Calibration bit 3 mask
.equ DAC_CH1GAINCAL3_bp = 3 ; Gain Calibration bit 3 position
.equ DAC_CH1GAINCAL4_bm = (1<<4) ; Gain Calibration bit 4 mask
.equ DAC_CH1GAINCAL4_bp = 4 ; Gain Calibration bit 4 position
.equ DAC_CH1GAINCAL5_bm = (1<<5) ; Gain Calibration bit 5 mask
.equ DAC_CH1GAINCAL5_bp = 5 ; Gain Calibration bit 5 position
.equ DAC_CH1GAINCAL6_bm = (1<<6) ; Gain Calibration bit 6 mask
.equ DAC_CH1GAINCAL6_bp = 6 ; Gain Calibration bit 6 position

; DAC_CH1OFFSETCAL masks
.equ DAC_CH1OFFSETCAL_gm = 0x7F ; Offset Calibration group mask
.equ DAC_CH1OFFSETCAL_gp = 0 ; Offset Calibration group position
.equ DAC_CH1OFFSETCAL0_bm = (1<<0) ; Offset Calibration bit 0 mask
.equ DAC_CH1OFFSETCAL0_bp = 0 ; Offset Calibration bit 0 position
.equ DAC_CH1OFFSETCAL1_bm = (1<<1) ; Offset Calibration bit 1 mask
.equ DAC_CH1OFFSETCAL1_bp = 1 ; Offset Calibration bit 1 position
.equ DAC_CH1OFFSETCAL2_bm = (1<<2) ; Offset Calibration bit 2 mask
.equ DAC_CH1OFFSETCAL2_bp = 2 ; Offset Calibration bit 2 position
.equ DAC_CH1OFFSETCAL3_bm = (1<<3) ; Offset Calibration bit 3 mask
.equ DAC_CH1OFFSETCAL3_bp = 3 ; Offset Calibration bit 3 position
.equ DAC_CH1OFFSETCAL4_bm = (1<<4) ; Offset Calibration bit 4 mask
.equ DAC_CH1OFFSETCAL4_bp = 4 ; Offset Calibration bit 4 position
.equ DAC_CH1OFFSETCAL5_bm = (1<<5) ; Offset Calibration bit 5 mask
.equ DAC_CH1OFFSETCAL5_bp = 5 ; Offset Calibration bit 5 position
.equ DAC_CH1OFFSETCAL6_bm = (1<<6) ; Offset Calibration bit 6 mask
.equ DAC_CH1OFFSETCAL6_bp = 6 ; Offset Calibration bit 6 position

; Output channel selection
.equ DAC_CHSEL_SINGLE_gc = (0x00<<5) ; Single channel operation (Channel 0 only)
.equ DAC_CHSEL_SINGLE1_gc = (0x01<<5) ; Single channel operation (Channel 1 only)
.equ DAC_CHSEL_DUAL_gc = (0x02<<5) ; Dual channel operation (Channel 0 and channel 1)

; Reference voltage selection
.equ DAC_REFSEL_INT1V_gc = (0x00<<3) ; Internal 1V 
.equ DAC_REFSEL_AVCC_gc = (0x01<<3) ; Analog supply voltage
.equ DAC_REFSEL_AREFA_gc = (0x02<<3) ; External reference on AREF on PORTA
.equ DAC_REFSEL_AREFB_gc = (0x03<<3) ; External reference on AREF on PORTB

; Event channel selection
.equ DAC_EVSEL_0_gc = (0x00<<0) ; Event Channel 0
.equ DAC_EVSEL_1_gc = (0x01<<0) ; Event Channel 1
.equ DAC_EVSEL_2_gc = (0x02<<0) ; Event Channel 2
.equ DAC_EVSEL_3_gc = (0x03<<0) ; Event Channel 3
.equ DAC_EVSEL_4_gc = (0x04<<0) ; Event Channel 4
.equ DAC_EVSEL_5_gc = (0x05<<0) ; Event Channel 5
.equ DAC_EVSEL_6_gc = (0x06<<0) ; Event Channel 6
.equ DAC_EVSEL_7_gc = (0x07<<0) ; Event Channel 7

; Conversion interval
.equ DAC_CONINTVAL_1CLK_gc = (0x00<<4) ; 1 CLK / 2 CLK in S/H mode
.equ DAC_CONINTVAL_2CLK_gc = (0x01<<4) ; 2 CLK / 3 CLK in S/H mode
.equ DAC_CONINTVAL_4CLK_gc = (0x02<<4) ; 4 CLK / 6 CLK in S/H mode
.equ DAC_CONINTVAL_8CLK_gc = (0x03<<4) ; 8 CLK / 12 CLK in S/H mode
.equ DAC_CONINTVAL_16CLK_gc = (0x04<<4) ; 16 CLK / 24 CLK in S/H mode
.equ DAC_CONINTVAL_32CLK_gc = (0x05<<4) ; 32 CLK / 48 CLK in S/H mode
.equ DAC_CONINTVAL_64CLK_gc = (0x06<<4) ; 64 CLK / 96 CLK in S/H mode
.equ DAC_CONINTVAL_128CLK_gc = (0x07<<4) ; 128 CLK / 192 CLK in S/H mode

; Refresh rate
.equ DAC_REFRESH_16CLK_gc = (0x00<<0) ; 16 CLK
.equ DAC_REFRESH_32CLK_gc = (0x01<<0) ; 32 CLK
.equ DAC_REFRESH_64CLK_gc = (0x02<<0) ; 64 CLK
.equ DAC_REFRESH_128CLK_gc = (0x03<<0) ; 128 CLK
.equ DAC_REFRESH_256CLK_gc = (0x04<<0) ; 256 CLK
.equ DAC_REFRESH_512CLK_gc = (0x05<<0) ; 512 CLK
.equ DAC_REFRESH_1024CLK_gc = (0x06<<0) ; 1024 CLK
.equ DAC_REFRESH_2048CLK_gc = (0x07<<0) ; 2048 CLK
.equ DAC_REFRESH_4096CLK_gc = (0x08<<0) ; 4096 CLK
.equ DAC_REFRESH_8192CLK_gc = (0x09<<0) ; 8192 CLK
.equ DAC_REFRESH_16384CLK_gc = (0x0A<<0) ; 16384 CLK
.equ DAC_REFRESH_32768CLK_gc = (0x0B<<0) ; 32768 CLK
.equ DAC_REFRESH_65536CLK_gc = (0x0C<<0) ; 65536 CLK
.equ DAC_REFRESH_OFF_gc = (0x0F<<0) ; Auto refresh OFF


;*************************************************************************
;** AC - Analog Comparator
;*************************************************************************

; AC_AC0CTRL masks
.equ AC_INTMODE_gm = 0xC0 ; Interrupt Mode group mask
.equ AC_INTMODE_gp = 6 ; Interrupt Mode group position
.equ AC_INTMODE0_bm = (1<<6) ; Interrupt Mode bit 0 mask
.equ AC_INTMODE0_bp = 6 ; Interrupt Mode bit 0 position
.equ AC_INTMODE1_bm = (1<<7) ; Interrupt Mode bit 1 mask
.equ AC_INTMODE1_bp = 7 ; Interrupt Mode bit 1 position
.equ AC_INTLVL_gm = 0x30 ; Interrupt Level group mask
.equ AC_INTLVL_gp = 4 ; Interrupt Level group position
.equ AC_INTLVL0_bm = (1<<4) ; Interrupt Level bit 0 mask
.equ AC_INTLVL0_bp = 4 ; Interrupt Level bit 0 position
.equ AC_INTLVL1_bm = (1<<5) ; Interrupt Level bit 1 mask
.equ AC_INTLVL1_bp = 5 ; Interrupt Level bit 1 position
.equ AC_HYSMODE_gm = 0x06 ; Hysteresis Mode group mask
.equ AC_HYSMODE_gp = 1 ; Hysteresis Mode group position
.equ AC_HYSMODE0_bm = (1<<1) ; Hysteresis Mode bit 0 mask
.equ AC_HYSMODE0_bp = 1 ; Hysteresis Mode bit 0 position
.equ AC_HYSMODE1_bm = (1<<2) ; Hysteresis Mode bit 1 mask
.equ AC_HYSMODE1_bp = 2 ; Hysteresis Mode bit 1 position
.equ AC_ENABLE_bm = 0x01 ; Enable bit mask
.equ AC_ENABLE_bp = 0 ; Enable bit position

; AC_AC1CTRL masks
; Masks for AC_INTMODE already defined
; Masks for AC_INTLVL already defined
; Masks for AC_HYSMODE already defined
; Masks for AC_ENABLE already defined

