trol73/avr-make/asm/include/ATxmega8E5def.inc
; XCL_CTRLD masks
.equ XCL_TRUTH1_gm = 0xF0 ; Truth Table of LUT1 group mask
.equ XCL_TRUTH1_gp = 4 ; Truth Table of LUT1 group position
.equ XCL_TRUTH10_bm = (1<<4) ; Truth Table of LUT1 bit 0 mask
.equ XCL_TRUTH10_bp = 4 ; Truth Table of LUT1 bit 0 position
.equ XCL_TRUTH11_bm = (1<<5) ; Truth Table of LUT1 bit 1 mask
.equ XCL_TRUTH11_bp = 5 ; Truth Table of LUT1 bit 1 position
.equ XCL_TRUTH12_bm = (1<<6) ; Truth Table of LUT1 bit 2 mask
.equ XCL_TRUTH12_bp = 6 ; Truth Table of LUT1 bit 2 position
.equ XCL_TRUTH13_bm = (1<<7) ; Truth Table of LUT1 bit 3 mask
.equ XCL_TRUTH13_bp = 7 ; Truth Table of LUT1 bit 3 position
.equ XCL_TRUTH0_gm = 0x0F ; Truth Table of LUT0 group mask
.equ XCL_TRUTH0_gp = 0 ; Truth Table of LUT0 group position
.equ XCL_TRUTH00_bm = (1<<0) ; Truth Table of LUT0 bit 0 mask
.equ XCL_TRUTH00_bp = 0 ; Truth Table of LUT0 bit 0 position
.equ XCL_TRUTH01_bm = (1<<1) ; Truth Table of LUT0 bit 1 mask
.equ XCL_TRUTH01_bp = 1 ; Truth Table of LUT0 bit 1 position
.equ XCL_TRUTH02_bm = (1<<2) ; Truth Table of LUT0 bit 2 mask
.equ XCL_TRUTH02_bp = 2 ; Truth Table of LUT0 bit 2 position
.equ XCL_TRUTH03_bm = (1<<3) ; Truth Table of LUT0 bit 3 mask
.equ XCL_TRUTH03_bp = 3 ; Truth Table of LUT0 bit 3 position

; XCL_CTRLE masks
.equ XCL_CMDSEL_bm = 0x80 ; Timer/Counter Command Selection bit mask
.equ XCL_CMDSEL_bp = 7 ; Timer/Counter Command Selection bit position
.equ XCL_TCSEL_gm = 0x70 ; Timer/Counter Selection group mask
.equ XCL_TCSEL_gp = 4 ; Timer/Counter Selection group position
.equ XCL_TCSEL0_bm = (1<<4) ; Timer/Counter Selection bit 0 mask
.equ XCL_TCSEL0_bp = 4 ; Timer/Counter Selection bit 0 position
.equ XCL_TCSEL1_bm = (1<<5) ; Timer/Counter Selection bit 1 mask
.equ XCL_TCSEL1_bp = 5 ; Timer/Counter Selection bit 1 position
.equ XCL_TCSEL2_bm = (1<<6) ; Timer/Counter Selection bit 2 mask
.equ XCL_TCSEL2_bp = 6 ; Timer/Counter Selection bit 2 position
.equ XCL_CLKSEL_gm = 0x0F ; Clock Selection group mask
.equ XCL_CLKSEL_gp = 0 ; Clock Selection group position
.equ XCL_CLKSEL0_bm = (1<<0) ; Clock Selection bit 0 mask
.equ XCL_CLKSEL0_bp = 0 ; Clock Selection bit 0 position
.equ XCL_CLKSEL1_bm = (1<<1) ; Clock Selection bit 1 mask
.equ XCL_CLKSEL1_bp = 1 ; Clock Selection bit 1 position
.equ XCL_CLKSEL2_bm = (1<<2) ; Clock Selection bit 2 mask
.equ XCL_CLKSEL2_bp = 2 ; Clock Selection bit 2 position
.equ XCL_CLKSEL3_bm = (1<<3) ; Clock Selection bit 3 mask
.equ XCL_CLKSEL3_bp = 3 ; Clock Selection bit 3 position

; XCL_CTRLF masks
.equ XCL_CMDEN_gm = 0xC0 ; Command Enable group mask
.equ XCL_CMDEN_gp = 6 ; Command Enable group position
.equ XCL_CMDEN0_bm = (1<<6) ; Command Enable bit 0 mask
.equ XCL_CMDEN0_bp = 6 ; Command Enable bit 0 position
.equ XCL_CMDEN1_bm = (1<<7) ; Command Enable bit 1 mask
.equ XCL_CMDEN1_bp = 7 ; Command Enable bit 1 position
.equ XCL_CMP1_bm = 0x20 ; Compare Channel 1 Output Value bit mask
.equ XCL_CMP1_bp = 5 ; Compare Channel 1 Output Value bit position
.equ XCL_CMP0_bm = 0x10 ; Compare Channel 0 Output Value bit mask
.equ XCL_CMP0_bp = 4 ; Compare Channel 0 Output Value bit position
.equ XCL_CCEN1_bm = 0x08 ; Compare or Capture Channel 1 Enable bit mask
.equ XCL_CCEN1_bp = 3 ; Compare or Capture Channel 1 Enable bit position
.equ XCL_CCEN0_bm = 0x04 ; Compare or Capture Channel 0 Enable bit mask
.equ XCL_CCEN0_bp = 2 ; Compare or Capture Channel 0 Enable bit position
.equ XCL_MODE_gm = 0x03 ; Timer/Counter Mode group mask
.equ XCL_MODE_gp = 0 ; Timer/Counter Mode group position
.equ XCL_MODE0_bm = (1<<0) ; Timer/Counter Mode bit 0 mask
.equ XCL_MODE0_bp = 0 ; Timer/Counter Mode bit 0 position
.equ XCL_MODE1_bm = (1<<1) ; Timer/Counter Mode bit 1 mask
.equ XCL_MODE1_bp = 1 ; Timer/Counter Mode bit 1 position

; XCL_CTRLG masks
.equ XCL_EVACTEN_bm = 0x80 ; Event Action Enable bit mask
.equ XCL_EVACTEN_bp = 7 ; Event Action Enable bit position
.equ XCL_EVACT1_gm = 0x60 ; Event Action Selection on Timer/Counter 1 group mask
.equ XCL_EVACT1_gp = 5 ; Event Action Selection on Timer/Counter 1 group position
.equ XCL_EVACT10_bm = (1<<5) ; Event Action Selection on Timer/Counter 1 bit 0 mask
.equ XCL_EVACT10_bp = 5 ; Event Action Selection on Timer/Counter 1 bit 0 position
.equ XCL_EVACT11_bm = (1<<6) ; Event Action Selection on Timer/Counter 1 bit 1 mask
.equ XCL_EVACT11_bp = 6 ; Event Action Selection on Timer/Counter 1 bit 1 position
.equ XCL_EVACT0_gm = 0x18 ; Event Action Selection on Timer/Counter 0 group mask
.equ XCL_EVACT0_gp = 3 ; Event Action Selection on Timer/Counter 0 group position
.equ XCL_EVACT00_bm = (1<<3) ; Event Action Selection on Timer/Counter 0 bit 0 mask
.equ XCL_EVACT00_bp = 3 ; Event Action Selection on Timer/Counter 0 bit 0 position
.equ XCL_EVACT01_bm = (1<<4) ; Event Action Selection on Timer/Counter 0 bit 1 mask
.equ XCL_EVACT01_bp = 4 ; Event Action Selection on Timer/Counter 0 bit 1 position
.equ XCL_EVSRC_gm = 0x07 ; Event Source Selection group mask
.equ XCL_EVSRC_gp = 0 ; Event Source Selection group position
.equ XCL_EVSRC0_bm = (1<<0) ; Event Source Selection bit 0 mask
.equ XCL_EVSRC0_bp = 0 ; Event Source Selection bit 0 position
.equ XCL_EVSRC1_bm = (1<<1) ; Event Source Selection bit 1 mask
.equ XCL_EVSRC1_bp = 1 ; Event Source Selection bit 1 position
.equ XCL_EVSRC2_bm = (1<<2) ; Event Source Selection bit 2 mask
.equ XCL_EVSRC2_bp = 2 ; Event Source Selection bit 2 position

; XCL_INTCTRL masks
.equ XCL_UNF1IE_bm = 0x80 ; Underflow 1 Interrupt Enable bit mask
.equ XCL_UNF1IE_bp = 7 ; Underflow 1 Interrupt Enable bit position
.equ XCL_PEC1IE_bm = 0x80 ; Peripheral Counter 1 Interrupt Enable bit mask
.equ XCL_PEC1IE_bp = 7 ; Peripheral Counter 1 Interrupt Enable bit position
.equ XCL_PEC21IE_bm = 0x80 ; Peripheral High Counter 2 Interrupt Enable bit mask
.equ XCL_PEC21IE_bp = 7 ; Peripheral High Counter 2 Interrupt Enable bit position
.equ XCL_UNF0IE_bm = 0x40 ; Underflow 0 Interrupt Enable bit mask
.equ XCL_UNF0IE_bp = 6 ; Underflow 0 Interrupt Enable bit position
.equ XCL_PEC0IE_bm = 0x40 ; Peripheral Counter 0 Interrupt Enable bit mask
.equ XCL_PEC0IE_bp = 6 ; Peripheral Counter 0 Interrupt Enable bit position
.equ XCL_CC1IE_bm = 0x20 ; Compare Or Capture 1 Interrupt Enable bit mask
.equ XCL_CC1IE_bp = 5 ; Compare Or Capture 1 Interrupt Enable bit position
.equ XCL_PEC20IE_bm = 0x20 ; Peripheral Low Counter 2 Interrupt Enable bit mask
.equ XCL_PEC20IE_bp = 5 ; Peripheral Low Counter 2 Interrupt Enable bit position
.equ XCL_CC0IE_bm = 0x10 ; Compare Or Capture 0 Interrupt Enable bit mask
.equ XCL_CC0IE_bp = 4 ; Compare Or Capture 0 Interrupt Enable bit position
.equ XCL_UNFINTLVL_gm = 0x0C ; Timer Underflow Interrupt Level group mask
.equ XCL_UNFINTLVL_gp = 2 ; Timer Underflow Interrupt Level group position
.equ XCL_UNFINTLVL0_bm = (1<<2) ; Timer Underflow Interrupt Level bit 0 mask
.equ XCL_UNFINTLVL0_bp = 2 ; Timer Underflow Interrupt Level bit 0 position
.equ XCL_UNFINTLVL1_bm = (1<<3) ; Timer Underflow Interrupt Level bit 1 mask
.equ XCL_UNFINTLVL1_bp = 3 ; Timer Underflow Interrupt Level bit 1 position
.equ XCL_CCINTLVL_gm = 0x03 ; Timer Compare or Capture Interrupt Level group mask
.equ XCL_CCINTLVL_gp = 0 ; Timer Compare or Capture Interrupt Level group position
.equ XCL_CCINTLVL0_bm = (1<<0) ; Timer Compare or Capture Interrupt Level bit 0 mask
.equ XCL_CCINTLVL0_bp = 0 ; Timer Compare or Capture Interrupt Level bit 0 position
.equ XCL_CCINTLVL1_bm = (1<<1) ; Timer Compare or Capture Interrupt Level bit 1 mask
.equ XCL_CCINTLVL1_bp = 1 ; Timer Compare or Capture Interrupt Level bit 1 position

