trol73/avr-make/asm/include/ATxmega8E5def.inc
; TC4_CTRLF masks
.equ TC4_HCCDMODE_gm = 0xC0 ; Channel High D Compare or Capture Mode group mask
.equ TC4_HCCDMODE_gp = 6 ; Channel High D Compare or Capture Mode group position
.equ TC4_HCCDMODE0_bm = (1<<6) ; Channel High D Compare or Capture Mode bit 0 mask
.equ TC4_HCCDMODE0_bp = 6 ; Channel High D Compare or Capture Mode bit 0 position
.equ TC4_HCCDMODE1_bm = (1<<7) ; Channel High D Compare or Capture Mode bit 1 mask
.equ TC4_HCCDMODE1_bp = 7 ; Channel High D Compare or Capture Mode bit 1 position
.equ TC4_HCCCMODE_gm = 0x30 ; Channel High C Compare or Capture Mode group mask
.equ TC4_HCCCMODE_gp = 4 ; Channel High C Compare or Capture Mode group position
.equ TC4_HCCCMODE0_bm = (1<<4) ; Channel High C Compare or Capture Mode bit 0 mask
.equ TC4_HCCCMODE0_bp = 4 ; Channel High C Compare or Capture Mode bit 0 position
.equ TC4_HCCCMODE1_bm = (1<<5) ; Channel High C Compare or Capture Mode bit 1 mask
.equ TC4_HCCCMODE1_bp = 5 ; Channel High C Compare or Capture Mode bit 1 position
.equ TC4_HCCBMODE_gm = 0x0C ; Channel High B Compare or Capture Mode group mask
.equ TC4_HCCBMODE_gp = 2 ; Channel High B Compare or Capture Mode group position
.equ TC4_HCCBMODE0_bm = (1<<2) ; Channel High B Compare or Capture Mode bit 0 mask
.equ TC4_HCCBMODE0_bp = 2 ; Channel High B Compare or Capture Mode bit 0 position
.equ TC4_HCCBMODE1_bm = (1<<3) ; Channel High B Compare or Capture Mode bit 1 mask
.equ TC4_HCCBMODE1_bp = 3 ; Channel High B Compare or Capture Mode bit 1 position
.equ TC4_HCCAMODE_gm = 0x03 ; Channel High A Compare or Capture Mode group mask
.equ TC4_HCCAMODE_gp = 0 ; Channel High A Compare or Capture Mode group position
.equ TC4_HCCAMODE0_bm = (1<<0) ; Channel High A Compare or Capture Mode bit 0 mask
.equ TC4_HCCAMODE0_bp = 0 ; Channel High A Compare or Capture Mode bit 0 position
.equ TC4_HCCAMODE1_bm = (1<<1) ; Channel High A Compare or Capture Mode bit 1 mask
.equ TC4_HCCAMODE1_bp = 1 ; Channel High A Compare or Capture Mode bit 1 position

; TC4_INTCTRLA masks
.equ TC4_TRGINTLVL_gm = 0x30 ; Timer Trigger Restart Interrupt Level group mask
.equ TC4_TRGINTLVL_gp = 4 ; Timer Trigger Restart Interrupt Level group position
.equ TC4_TRGINTLVL0_bm = (1<<4) ; Timer Trigger Restart Interrupt Level bit 0 mask
.equ TC4_TRGINTLVL0_bp = 4 ; Timer Trigger Restart Interrupt Level bit 0 position
.equ TC4_TRGINTLVL1_bm = (1<<5) ; Timer Trigger Restart Interrupt Level bit 1 mask
.equ TC4_TRGINTLVL1_bp = 5 ; Timer Trigger Restart Interrupt Level bit 1 position
.equ TC4_ERRINTLVL_gm = 0x0C ; Timer Error Interrupt Level group mask
.equ TC4_ERRINTLVL_gp = 2 ; Timer Error Interrupt Level group position
.equ TC4_ERRINTLVL0_bm = (1<<2) ; Timer Error Interrupt Level bit 0 mask
.equ TC4_ERRINTLVL0_bp = 2 ; Timer Error Interrupt Level bit 0 position
.equ TC4_ERRINTLVL1_bm = (1<<3) ; Timer Error Interrupt Level bit 1 mask
.equ TC4_ERRINTLVL1_bp = 3 ; Timer Error Interrupt Level bit 1 position
.equ TC4_OVFINTLVL_gm = 0x03 ; Timer Overflow/Underflow Interrupt Level group mask
.equ TC4_OVFINTLVL_gp = 0 ; Timer Overflow/Underflow Interrupt Level group position
.equ TC4_OVFINTLVL0_bm = (1<<0) ; Timer Overflow/Underflow Interrupt Level bit 0 mask
.equ TC4_OVFINTLVL0_bp = 0 ; Timer Overflow/Underflow Interrupt Level bit 0 position
.equ TC4_OVFINTLVL1_bm = (1<<1) ; Timer Overflow/Underflow Interrupt Level bit 1 mask
.equ TC4_OVFINTLVL1_bp = 1 ; Timer Overflow/Underflow Interrupt Level bit 1 position

; TC4_INTCTRLB masks
.equ TC4_CCDINTLVL_gm = 0xC0 ; Channel D Compare or Capture Interrupt Level group mask
.equ TC4_CCDINTLVL_gp = 6 ; Channel D Compare or Capture Interrupt Level group position
.equ TC4_CCDINTLVL0_bm = (1<<6) ; Channel D Compare or Capture Interrupt Level bit 0 mask
.equ TC4_CCDINTLVL0_bp = 6 ; Channel D Compare or Capture Interrupt Level bit 0 position
.equ TC4_CCDINTLVL1_bm = (1<<7) ; Channel D Compare or Capture Interrupt Level bit 1 mask
.equ TC4_CCDINTLVL1_bp = 7 ; Channel D Compare or Capture Interrupt Level bit 1 position
.equ TC4_CCCINTLVL_gm = 0x30 ; Channel C Compare or Capture Interrupt Level group mask
.equ TC4_CCCINTLVL_gp = 4 ; Channel C Compare or Capture Interrupt Level group position
.equ TC4_CCCINTLVL0_bm = (1<<4) ; Channel C Compare or Capture Interrupt Level bit 0 mask
.equ TC4_CCCINTLVL0_bp = 4 ; Channel C Compare or Capture Interrupt Level bit 0 position
.equ TC4_CCCINTLVL1_bm = (1<<5) ; Channel C Compare or Capture Interrupt Level bit 1 mask
.equ TC4_CCCINTLVL1_bp = 5 ; Channel C Compare or Capture Interrupt Level bit 1 position
.equ TC4_CCBINTLVL_gm = 0x0C ; Channel B Compare or Capture Interrupt Level group mask
.equ TC4_CCBINTLVL_gp = 2 ; Channel B Compare or Capture Interrupt Level group position
.equ TC4_CCBINTLVL0_bm = (1<<2) ; Channel B Compare or Capture Interrupt Level bit 0 mask
.equ TC4_CCBINTLVL0_bp = 2 ; Channel B Compare or Capture Interrupt Level bit 0 position
.equ TC4_CCBINTLVL1_bm = (1<<3) ; Channel B Compare or Capture Interrupt Level bit 1 mask
.equ TC4_CCBINTLVL1_bp = 3 ; Channel B Compare or Capture Interrupt Level bit 1 position
.equ TC4_CCAINTLVL_gm = 0x03 ; Channel A Compare or Capture Interrupt Level group mask
.equ TC4_CCAINTLVL_gp = 0 ; Channel A Compare or Capture Interrupt Level group position
.equ TC4_CCAINTLVL0_bm = (1<<0) ; Channel A Compare or Capture Interrupt Level bit 0 mask
.equ TC4_CCAINTLVL0_bp = 0 ; Channel A Compare or Capture Interrupt Level bit 0 position
.equ TC4_CCAINTLVL1_bm = (1<<1) ; Channel A Compare or Capture Interrupt Level bit 1 mask
.equ TC4_CCAINTLVL1_bp = 1 ; Channel A Compare or Capture Interrupt Level bit 1 position
.equ TC4_LCCDINTLVL_gm = 0xC0 ; Channel Low D Compare or Capture Interrupt Level group mask
.equ TC4_LCCDINTLVL_gp = 6 ; Channel Low D Compare or Capture Interrupt Level group position
.equ TC4_LCCDINTLVL0_bm = (1<<6) ; Channel Low D Compare or Capture Interrupt Level bit 0 mask
.equ TC4_LCCDINTLVL0_bp = 6 ; Channel Low D Compare or Capture Interrupt Level bit 0 position
.equ TC4_LCCDINTLVL1_bm = (1<<7) ; Channel Low D Compare or Capture Interrupt Level bit 1 mask
.equ TC4_LCCDINTLVL1_bp = 7 ; Channel Low D Compare or Capture Interrupt Level bit 1 position
.equ TC4_LCCCINTLVL_gm = 0x30 ; Channel Low C Compare or Capture Interrupt Level group mask
.equ TC4_LCCCINTLVL_gp = 4 ; Channel Low C Compare or Capture Interrupt Level group position
.equ TC4_LCCCINTLVL0_bm = (1<<4) ; Channel Low C Compare or Capture Interrupt Level bit 0 mask
.equ TC4_LCCCINTLVL0_bp = 4 ; Channel Low C Compare or Capture Interrupt Level bit 0 position
.equ TC4_LCCCINTLVL1_bm = (1<<5) ; Channel Low C Compare or Capture Interrupt Level bit 1 mask
.equ TC4_LCCCINTLVL1_bp = 5 ; Channel Low C Compare or Capture Interrupt Level bit 1 position
.equ TC4_LCCBINTLVL_gm = 0x0C ; Channel Low B Compare or Capture Interrupt Level group mask
.equ TC4_LCCBINTLVL_gp = 2 ; Channel Low B Compare or Capture Interrupt Level group position
.equ TC4_LCCBINTLVL0_bm = (1<<2) ; Channel Low B Compare or Capture Interrupt Level bit 0 mask
.equ TC4_LCCBINTLVL0_bp = 2 ; Channel Low B Compare or Capture Interrupt Level bit 0 position
.equ TC4_LCCBINTLVL1_bm = (1<<3) ; Channel Low B Compare or Capture Interrupt Level bit 1 mask
.equ TC4_LCCBINTLVL1_bp = 3 ; Channel Low B Compare or Capture Interrupt Level bit 1 position
.equ TC4_LCCAINTLVL_gm = 0x03 ; Channel Low A Compare or Capture Interrupt Level group mask
.equ TC4_LCCAINTLVL_gp = 0 ; Channel Low A Compare or Capture Interrupt Level group position
.equ TC4_LCCAINTLVL0_bm = (1<<0) ; Channel Low A Compare or Capture Interrupt Level bit 0 mask
.equ TC4_LCCAINTLVL0_bp = 0 ; Channel Low A Compare or Capture Interrupt Level bit 0 position
.equ TC4_LCCAINTLVL1_bm = (1<<1) ; Channel Low A Compare or Capture Interrupt Level bit 1 mask
.equ TC4_LCCAINTLVL1_bp = 1 ; Channel Low A Compare or Capture Interrupt Level bit 1 position

