trol73/avr-make/asm/include/ATxmega8E5def.inc
; Compare or Capture Low Channel C Mode
.equ TC45_LCCCMODE_DISABLE_gc = (0x00<<4) ; Channel Disabled
.equ TC45_LCCCMODE_COMP_gc = (0x01<<4) ; Ouput Compare enabled
.equ TC45_LCCCMODE_CAPT_gc = (0x02<<4) ; Input Capture enabled
.equ TC45_LCCCMODE_BOTHCC_gc = (0x03<<4) ; Both Compare and Capture enabled

; Compare or Capture Low Channel D Mode
.equ TC45_LCCDMODE_DISABLE_gc = (0x00<<6) ; Channel Disabled
.equ TC45_LCCDMODE_COMP_gc = (0x01<<6) ; Ouput Compare enabled
.equ TC45_LCCDMODE_CAPT_gc = (0x02<<6) ; Input Capture enabled
.equ TC45_LCCDMODE_BOTHCC_gc = (0x03<<6) ; Both Compare and Capture enabled

; Compare or Capture High Channel A Mode
.equ TC45_HCCAMODE_DISABLE_gc = (0x00<<0) ; Channel Disabled
.equ TC45_HCCAMODE_COMP_gc = (0x01<<0) ; Ouput Compare enabled
.equ TC45_HCCAMODE_CAPT_gc = (0x02<<0) ; Input Capture enabled
.equ TC45_HCCAMODE_BOTHCC_gc = (0x03<<0) ; Both Compare and Capture enabled

; Compare or Capture High Channel B Mode
.equ TC45_HCCBMODE_DISABLE_gc = (0x00<<2) ; Channel Disabled
.equ TC45_HCCBMODE_COMP_gc = (0x01<<2) ; Ouput Compare enabled
.equ TC45_HCCBMODE_CAPT_gc = (0x02<<2) ; Input Capture enabled
.equ TC45_HCCBMODE_BOTHCC_gc = (0x03<<2) ; Both Compare and Capture enabled

; Compare or Capture High Channel C Mode
.equ TC45_HCCCMODE_DISABLE_gc = (0x00<<4) ; Channel Disabled
.equ TC45_HCCCMODE_COMP_gc = (0x01<<4) ; Ouput Compare enabled
.equ TC45_HCCCMODE_CAPT_gc = (0x02<<4) ; Input Capture enabled
.equ TC45_HCCCMODE_BOTHCC_gc = (0x03<<4) ; Both Compare and Capture enabled

; Compare or Capture High Channel D Mode
.equ TC45_HCCDMODE_DISABLE_gc = (0x00<<6) ; Channel Disabled
.equ TC45_HCCDMODE_COMP_gc = (0x01<<6) ; Ouput Compare enabled
.equ TC45_HCCDMODE_CAPT_gc = (0x02<<6) ; Input Capture enabled
.equ TC45_HCCDMODE_BOTHCC_gc = (0x03<<6) ; Both Compare and Capture enabled

; Timer Trigger Restart Interrupt Level
.equ TC45_TRGINTLVL_OFF_gc = (0x00<<4) ; Interrupt Disabled
.equ TC45_TRGINTLVL_LO_gc = (0x01<<4) ; Low Level
.equ TC45_TRGINTLVL_MED_gc = (0x02<<4) ; Medium Level
.equ TC45_TRGINTLVL_HI_gc = (0x03<<4) ; High Level

; Error Interrupt Level
.equ TC45_ERRINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC45_ERRINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC45_ERRINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC45_ERRINTLVL_HI_gc = (0x03<<2) ; High Level

; Overflow Interrupt Level
.equ TC45_OVFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC45_OVFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC45_OVFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC45_OVFINTLVL_HI_gc = (0x03<<0) ; High Level

; Compare or Capture Channel A Interrupt Level
.equ TC45_CCAINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC45_CCAINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC45_CCAINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC45_CCAINTLVL_HI_gc = (0x03<<0) ; High Level

; Compare or Capture Channel B Interrupt Level
.equ TC45_CCBINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC45_CCBINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC45_CCBINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC45_CCBINTLVL_HI_gc = (0x03<<2) ; High Level

; Compare or Capture Channel C Interrupt Level
.equ TC45_CCCINTLVL_OFF_gc = (0x00<<4) ; Interrupt Disabled
.equ TC45_CCCINTLVL_LO_gc = (0x01<<4) ; Low Level
.equ TC45_CCCINTLVL_MED_gc = (0x02<<4) ; Medium Level
.equ TC45_CCCINTLVL_HI_gc = (0x03<<4) ; High Level

; Compare or Capture Channel D Interrupt Level
.equ TC45_CCDINTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TC45_CCDINTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TC45_CCDINTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TC45_CCDINTLVL_HI_gc = (0x03<<6) ; High Level

; Compare or Capture Low Channel A Interrupt Level
.equ TC45_LCCAINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC45_LCCAINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC45_LCCAINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC45_LCCAINTLVL_HI_gc = (0x03<<0) ; High Level

; Compare or Capture Low Channel B Interrupt Level
.equ TC45_LCCBINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC45_LCCBINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC45_LCCBINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC45_LCCBINTLVL_HI_gc = (0x03<<2) ; High Level

; Compare or Capture Low Channel C Interrupt Level
.equ TC45_LCCCINTLVL_OFF_gc = (0x00<<4) ; Interrupt Disabled
.equ TC45_LCCCINTLVL_LO_gc = (0x01<<4) ; Low Level
.equ TC45_LCCCINTLVL_MED_gc = (0x02<<4) ; Medium Level
.equ TC45_LCCCINTLVL_HI_gc = (0x03<<4) ; High Level

; Compare or Capture Low Channel D Interrupt Level
.equ TC45_LCCDINTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TC45_LCCDINTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TC45_LCCDINTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TC45_LCCDINTLVL_HI_gc = (0x03<<6) ; High Level

; Timer/Counter Command
.equ TC45_CMD_NONE_gc = (0x00<<2) ; No Command
.equ TC45_CMD_UPDATE_gc = (0x01<<2) ; Force Update
.equ TC45_CMD_RESTART_gc = (0x02<<2) ; Force Restart
.equ TC45_CMD_RESET_gc = (0x03<<2) ; Force Hard Reset


;*************************************************************************
;** FAULT - Fault Extension
;*************************************************************************

; FAULT_CTRLA masks
.equ FAULT_RAMP_gm = 0xC0 ; Ramp Mode Selection group mask
.equ FAULT_RAMP_gp = 6 ; Ramp Mode Selection group position
.equ FAULT_RAMP0_bm = (1<<6) ; Ramp Mode Selection bit 0 mask
.equ FAULT_RAMP0_bp = 6 ; Ramp Mode Selection bit 0 position
.equ FAULT_RAMP1_bm = (1<<7) ; Ramp Mode Selection bit 1 mask
.equ FAULT_RAMP1_bp = 7 ; Ramp Mode Selection bit 1 position
.equ FAULT_FDDBD_bm = 0x20 ; Fault on Debug Break Detection bit mask
.equ FAULT_FDDBD_bp = 5 ; Fault on Debug Break Detection bit position
.equ FAULT_PORTCTRL_bm = 0x10 ; Port Control Mode bit mask
.equ FAULT_PORTCTRL_bp = 4 ; Port Control Mode bit position
.equ FAULT_FUSE_bm = 0x08 ; Fuse State  bit mask
.equ FAULT_FUSE_bp = 3 ; Fuse State  bit position
.equ FAULT_FILTERE_bm = 0x04 ; Fault E Digital Filter Selection bit mask
.equ FAULT_FILTERE_bp = 2 ; Fault E Digital Filter Selection bit position
.equ FAULT_SRCE_gm = 0x03 ; Fault E Input selection group mask
.equ FAULT_SRCE_gp = 0 ; Fault E Input selection group position
.equ FAULT_SRCE0_bm = (1<<0) ; Fault E Input selection bit 0 mask
.equ FAULT_SRCE0_bp = 0 ; Fault E Input selection bit 0 position
.equ FAULT_SRCE1_bm = (1<<1) ; Fault E Input selection bit 1 mask
.equ FAULT_SRCE1_bp = 1 ; Fault E Input selection bit 1 position

