trol73/avr-make/asm/include/ATxmega8E5def.inc
; Fault B Halt Action Selection
.equ FAULT_HALTB_DISABLE_gc = (0x00<<5) ; Halt Action Disabled
.equ FAULT_HALTB_HW_gc = (0x01<<5) ; Hardware Halt Action
.equ FAULT_HALTB_SW_gc = (0x02<<5) ; Software Halt Action

; Fault B Source Selection
.equ FAULT_SRCB_DISABLE_gc = (0x00<<0) ; Fault B disabled
.equ FAULT_SRCB_CHN_gc = (0x01<<0) ; Event Channel n
.equ FAULT_SRCB_CHN1_gc = (0x02<<0) ; Event Channel n+1
.equ FAULT_SRCB_LINK_gc = (0x03<<0) ; Fault B linked to Fault A State from previous cycle

; Channel index Command
.equ FAULT_IDXCMD_DISABLE_gc = (0x00<<3) ; Command Disabled
.equ FAULT_IDXCMD_SET_gc = (0x01<<3) ; Force Cycle B in Next Cycle
.equ FAULT_IDXCMD_CLEAR_gc = (0x02<<3) ; Force Cycle A in Next Cycle
.equ FAULT_IDXCMD_HOLD_gc = (0x03<<3) ; Hold Current Cycle Index in Next Cycle 


;*************************************************************************
;** WEX - Waveform Extension
;*************************************************************************

; WEX_CTRL masks
.equ WEX_UPSEL_bm = 0x80 ; Update Source Selection bit mask
.equ WEX_UPSEL_bp = 7 ; Update Source Selection bit position
.equ WEX_OTMX_gm = 0x70 ; Output Matrix group mask
.equ WEX_OTMX_gp = 4 ; Output Matrix group position
.equ WEX_OTMX0_bm = (1<<4) ; Output Matrix bit 0 mask
.equ WEX_OTMX0_bp = 4 ; Output Matrix bit 0 position
.equ WEX_OTMX1_bm = (1<<5) ; Output Matrix bit 1 mask
.equ WEX_OTMX1_bp = 5 ; Output Matrix bit 1 position
.equ WEX_OTMX2_bm = (1<<6) ; Output Matrix bit 2 mask
.equ WEX_OTMX2_bp = 6 ; Output Matrix bit 2 position
.equ WEX_DTI3EN_bm = 0x08 ; Dead-Time Insertion Generator 3 Enable bit mask
.equ WEX_DTI3EN_bp = 3 ; Dead-Time Insertion Generator 3 Enable bit position
.equ WEX_DTI2EN_bm = 0x04 ; Dead-Time Insertion Generator 2 Enable bit mask
.equ WEX_DTI2EN_bp = 2 ; Dead-Time Insertion Generator 2 Enable bit position
.equ WEX_DTI1EN_bm = 0x02 ; Dead-Time Insertion Generator 1 Enable bit mask
.equ WEX_DTI1EN_bp = 1 ; Dead-Time Insertion Generator 1 Enable bit position
.equ WEX_DTI0EN_bm = 0x01 ; Dead-Time Insertion Generator 0 Enable bit mask
.equ WEX_DTI0EN_bp = 0 ; Dead-Time Insertion Generator 0 Enable bit position

; WEX_STATUSCLR masks
.equ WEX_SWAPBUF_bm = 0x04 ; Swap Buffer Valid  bit mask
.equ WEX_SWAPBUF_bp = 2 ; Swap Buffer Valid  bit position
.equ WEX_PGVBUFV_bm = 0x02 ; Pattern Generator Value Buffer Valid  bit mask
.equ WEX_PGVBUFV_bp = 1 ; Pattern Generator Value Buffer Valid  bit position
.equ WEX_PGOBUFV_bm = 0x01 ; Pattern Generator Overwrite Buffer Valid bit mask
.equ WEX_PGOBUFV_bp = 0 ; Pattern Generator Overwrite Buffer Valid bit position

; WEX_STATUSSET masks
; Masks for WEX_SWAPBUF already defined
; Masks for WEX_PGVBUFV already defined
; Masks for WEX_PGOBUFV already defined

; WEX_SWAP masks
.equ WEX_SWAP3_bm = 0x08 ; Swap DTI output pair 3 bit mask
.equ WEX_SWAP3_bp = 3 ; Swap DTI output pair 3 bit position
.equ WEX_SWAP2_bm = 0x04 ; Swap DTI output pair 2 bit mask
.equ WEX_SWAP2_bp = 2 ; Swap DTI output pair 2 bit position
.equ WEX_SWAP1_bm = 0x02 ; Swap DTI output pair 1 bit mask
.equ WEX_SWAP1_bp = 1 ; Swap DTI output pair 1 bit position
.equ WEX_SWAP0_bm = 0x01 ; Swap DTI output pair 0 bit mask
.equ WEX_SWAP0_bp = 0 ; Swap DTI output pair 0 bit position

; WEX_SWAPBUF masks
.equ WEX_SWAP3BUF_bm = 0x08 ; Swap DTI output pair 3  bit mask
.equ WEX_SWAP3BUF_bp = 3 ; Swap DTI output pair 3  bit position
.equ WEX_SWAP2BUF_bm = 0x04 ; Swap DTI output pair 2 bit mask
.equ WEX_SWAP2BUF_bp = 2 ; Swap DTI output pair 2 bit position
.equ WEX_SWAP1BUF_bm = 0x02 ; Swap DTI output pair 1  bit mask
.equ WEX_SWAP1BUF_bp = 1 ; Swap DTI output pair 1  bit position
.equ WEX_SWAP0BUF_bm = 0x01 ; Swap DTI output pair 0 bit mask
.equ WEX_SWAP0BUF_bp = 0 ; Swap DTI output pair 0 bit position

; Output Matrix Mode
.equ WEX_OTMX_DEFAULT_gc = (0x00<<4) ; Default Ouput Matrix Mode
.equ WEX_OTMX_FIRST_gc = (0x01<<4) ; First Output matrix Mode
.equ WEX_OTMX_SECOND_gc = (0x02<<4) ; Second Output matrix Mode
.equ WEX_OTMX_THIRD_gc = (0x03<<4) ; Third Output matrix Mode
.equ WEX_OTMX_FOURTH_gc = (0x04<<4) ; Fourth Output matrix Mode


;*************************************************************************
;** HIRES - High-Resolution Extension
;*************************************************************************

; HIRES_CTRLA masks
.equ HIRES_HRPLUS_gm = 0x0C ; High Resolution Plus group mask
.equ HIRES_HRPLUS_gp = 2 ; High Resolution Plus group position
.equ HIRES_HRPLUS0_bm = (1<<2) ; High Resolution Plus bit 0 mask
.equ HIRES_HRPLUS0_bp = 2 ; High Resolution Plus bit 0 position
.equ HIRES_HRPLUS1_bm = (1<<3) ; High Resolution Plus bit 1 mask
.equ HIRES_HRPLUS1_bp = 3 ; High Resolution Plus bit 1 position
.equ HIRES_HREN_gm = 0x03 ; High Resolution Mode group mask
.equ HIRES_HREN_gp = 0 ; High Resolution Mode group position
.equ HIRES_HREN0_bm = (1<<0) ; High Resolution Mode bit 0 mask
.equ HIRES_HREN0_bp = 0 ; High Resolution Mode bit 0 position
.equ HIRES_HREN1_bm = (1<<1) ; High Resolution Mode bit 1 mask
.equ HIRES_HREN1_bp = 1 ; High Resolution Mode bit 1 position

; High Resolution Plus Mode
.equ HIRES_HRPLUS_NONE_gc = (0x00<<2) ; No Hi-Res Plus
.equ HIRES_HRPLUS_HRP4_gc = (0x01<<2) ; Hi-Res Plus enabled on Timer 4
.equ HIRES_HRPLUS_HRP5_gc = (0x03<<2) ; Hi-Res Plus enabled on Timer 5
.equ HIRES_HRPLUS_BOTH_gc = (0x03<<2) ; Hi-Res Plus enabled on Timer 4 and 5

; High Resolution Mode
.equ HIRES_HREN_NONE_gc = (0x00<<0) ; No Hi-Res
.equ HIRES_HREN_HRP4_gc = (0x01<<0) ; Hi-Res enabled on Timer 4
.equ HIRES_HREN_HRP5_gc = (0x03<<0) ; Hi-Res enabled on Timer 5
.equ HIRES_HREN_BOTH_gc = (0x03<<0) ; Hi-Res enabled on Timer 4 and 5


;*************************************************************************
;** USART - Universal Asynchronous Receiver-Transmitter
;*************************************************************************

; USART_STATUS masks
.equ USART_RXCIF_bm = 0x80 ; Receive Interrupt Flag bit mask
.equ USART_RXCIF_bp = 7 ; Receive Interrupt Flag bit position
.equ USART_TXCIF_bm = 0x40 ; Transmit Interrupt Flag bit mask
.equ USART_TXCIF_bp = 6 ; Transmit Interrupt Flag bit position
.equ USART_DREIF_bm = 0x20 ; Data Register Empty Flag bit mask
.equ USART_DREIF_bp = 5 ; Data Register Empty Flag bit position
.equ USART_FERR_bm = 0x10 ; Frame Error bit mask
.equ USART_FERR_bp = 4 ; Frame Error bit position
.equ USART_BUFOVF_bm = 0x08 ; Buffer Overflow bit mask
.equ USART_BUFOVF_bp = 3 ; Buffer Overflow bit position
.equ USART_PERR_bm = 0x04 ; Parity Error bit mask
.equ USART_PERR_bp = 2 ; Parity Error bit position
.equ USART_RXSIF_bm = 0x02 ; Receive Start Bit Interrupt Flag bit mask
.equ USART_RXSIF_bp = 1 ; Receive Start Bit Interrupt Flag bit position
.equ USART_RXB8_bm = 0x01 ; Receive Bit 8 bit mask
.equ USART_RXB8_bp = 0 ; Receive Bit 8 bit position
.equ USART_DRIF_bm = 0x01 ; Data Reception Flag bit mask
.equ USART_DRIF_bp = 0 ; Data Reception Flag bit position

; USART_CTRLA masks
.equ USART_RXSIE_bm = 0x80 ; Receive Start Interrupt Enable bit mask
.equ USART_RXSIE_bp = 7 ; Receive Start Interrupt Enable bit position
.equ USART_DRIE_bm = 0x40 ; Data Reception Interrupt Enable bit mask
.equ USART_DRIE_bp = 6 ; Data Reception Interrupt Enable bit position
.equ USART_RXCINTLVL_gm = 0x30 ; Receive Interrupt Level group mask
.equ USART_RXCINTLVL_gp = 4 ; Receive Interrupt Level group position
.equ USART_RXCINTLVL0_bm = (1<<4) ; Receive Interrupt Level bit 0 mask
.equ USART_RXCINTLVL0_bp = 4 ; Receive Interrupt Level bit 0 position
.equ USART_RXCINTLVL1_bm = (1<<5) ; Receive Interrupt Level bit 1 mask
.equ USART_RXCINTLVL1_bp = 5 ; Receive Interrupt Level bit 1 position
.equ USART_TXCINTLVL_gm = 0x0C ; Transmit Interrupt Level group mask
.equ USART_TXCINTLVL_gp = 2 ; Transmit Interrupt Level group position
.equ USART_TXCINTLVL0_bm = (1<<2) ; Transmit Interrupt Level bit 0 mask
.equ USART_TXCINTLVL0_bp = 2 ; Transmit Interrupt Level bit 0 position
.equ USART_TXCINTLVL1_bm = (1<<3) ; Transmit Interrupt Level bit 1 mask
.equ USART_TXCINTLVL1_bp = 3 ; Transmit Interrupt Level bit 1 position
.equ USART_DREINTLVL_gm = 0x03 ; Data Register Empty Interrupt Level group mask
.equ USART_DREINTLVL_gp = 0 ; Data Register Empty Interrupt Level group position
.equ USART_DREINTLVL0_bm = (1<<0) ; Data Register Empty Interrupt Level bit 0 mask
.equ USART_DREINTLVL0_bp = 0 ; Data Register Empty Interrupt Level bit 0 position
.equ USART_DREINTLVL1_bm = (1<<1) ; Data Register Empty Interrupt Level bit 1 mask
.equ USART_DREINTLVL1_bp = 1 ; Data Register Empty Interrupt Level bit 1 position

