trol73/avr-make/asm/include/ATxmega8E5def.inc
; NVM_FUSES_FUSEBYTE2 masks
.equ NVM_FUSES_BOOTRST_bm = 0x40 ; Boot Loader Section Reset Vector bit mask
.equ NVM_FUSES_BOOTRST_bp = 6 ; Boot Loader Section Reset Vector bit position
.equ NVM_FUSES_BODPD_gm = 0x03 ; BOD Operation in Power-Down Mode group mask
.equ NVM_FUSES_BODPD_gp = 0 ; BOD Operation in Power-Down Mode group position
.equ NVM_FUSES_BODPD0_bm = (1<<0) ; BOD Operation in Power-Down Mode bit 0 mask
.equ NVM_FUSES_BODPD0_bp = 0 ; BOD Operation in Power-Down Mode bit 0 position
.equ NVM_FUSES_BODPD1_bm = (1<<1) ; BOD Operation in Power-Down Mode bit 1 mask
.equ NVM_FUSES_BODPD1_bp = 1 ; BOD Operation in Power-Down Mode bit 1 position

; NVM_FUSES_FUSEBYTE4 masks
.equ NVM_FUSES_RSTDISBL_bm = 0x10 ; External Reset Disable bit mask
.equ NVM_FUSES_RSTDISBL_bp = 4 ; External Reset Disable bit position
.equ NVM_FUSES_SUT_gm = 0x0C ; Start-up Time group mask
.equ NVM_FUSES_SUT_gp = 2 ; Start-up Time group position
.equ NVM_FUSES_SUT0_bm = (1<<2) ; Start-up Time bit 0 mask
.equ NVM_FUSES_SUT0_bp = 2 ; Start-up Time bit 0 position
.equ NVM_FUSES_SUT1_bm = (1<<3) ; Start-up Time bit 1 mask
.equ NVM_FUSES_SUT1_bp = 3 ; Start-up Time bit 1 position
.equ NVM_FUSES_WDLOCK_bm = 0x02 ; Watchdog Timer Lock bit mask
.equ NVM_FUSES_WDLOCK_bp = 1 ; Watchdog Timer Lock bit position

; NVM_FUSES_FUSEBYTE5 masks
.equ NVM_FUSES_BODACT_gm = 0x30 ; BOD Operation in Active Mode group mask
.equ NVM_FUSES_BODACT_gp = 4 ; BOD Operation in Active Mode group position
.equ NVM_FUSES_BODACT0_bm = (1<<4) ; BOD Operation in Active Mode bit 0 mask
.equ NVM_FUSES_BODACT0_bp = 4 ; BOD Operation in Active Mode bit 0 position
.equ NVM_FUSES_BODACT1_bm = (1<<5) ; BOD Operation in Active Mode bit 1 mask
.equ NVM_FUSES_BODACT1_bp = 5 ; BOD Operation in Active Mode bit 1 position
.equ NVM_FUSES_EESAVE_bm = 0x08 ; Preserve EEPROM Through Chip Erase bit mask
.equ NVM_FUSES_EESAVE_bp = 3 ; Preserve EEPROM Through Chip Erase bit position
.equ NVM_FUSES_BODLVL_gm = 0x07 ; Brown Out Detection Voltage Level group mask
.equ NVM_FUSES_BODLVL_gp = 0 ; Brown Out Detection Voltage Level group position
.equ NVM_FUSES_BODLVL0_bm = (1<<0) ; Brown Out Detection Voltage Level bit 0 mask
.equ NVM_FUSES_BODLVL0_bp = 0 ; Brown Out Detection Voltage Level bit 0 position
.equ NVM_FUSES_BODLVL1_bm = (1<<1) ; Brown Out Detection Voltage Level bit 1 mask
.equ NVM_FUSES_BODLVL1_bp = 1 ; Brown Out Detection Voltage Level bit 1 position
.equ NVM_FUSES_BODLVL2_bm = (1<<2) ; Brown Out Detection Voltage Level bit 2 mask
.equ NVM_FUSES_BODLVL2_bp = 2 ; Brown Out Detection Voltage Level bit 2 position

; NVM_FUSES_FUSEBYTE6 masks
.equ NVM_FUSES_FDACT5_bm = 0x80 ; Fault Dectection Action on TC5 bit mask
.equ NVM_FUSES_FDACT5_bp = 7 ; Fault Dectection Action on TC5 bit position
.equ NVM_FUSES_FDACT4_bm = 0x40 ; Fault Dectection Action on TC4 bit mask
.equ NVM_FUSES_FDACT4_bp = 6 ; Fault Dectection Action on TC4 bit position
.equ NVM_FUSES_VALUE_gm = 0x3F ; Port Pin Value group mask
.equ NVM_FUSES_VALUE_gp = 0 ; Port Pin Value group position
.equ NVM_FUSES_VALUE0_bm = (1<<0) ; Port Pin Value bit 0 mask
.equ NVM_FUSES_VALUE0_bp = 0 ; Port Pin Value bit 0 position
.equ NVM_FUSES_VALUE1_bm = (1<<1) ; Port Pin Value bit 1 mask
.equ NVM_FUSES_VALUE1_bp = 1 ; Port Pin Value bit 1 position
.equ NVM_FUSES_VALUE2_bm = (1<<2) ; Port Pin Value bit 2 mask
.equ NVM_FUSES_VALUE2_bp = 2 ; Port Pin Value bit 2 position
.equ NVM_FUSES_VALUE3_bm = (1<<3) ; Port Pin Value bit 3 mask
.equ NVM_FUSES_VALUE3_bp = 3 ; Port Pin Value bit 3 position
.equ NVM_FUSES_VALUE4_bm = (1<<4) ; Port Pin Value bit 4 mask
.equ NVM_FUSES_VALUE4_bp = 4 ; Port Pin Value bit 4 position
.equ NVM_FUSES_VALUE5_bm = (1<<5) ; Port Pin Value bit 5 mask
.equ NVM_FUSES_VALUE5_bp = 5 ; Port Pin Value bit 5 position

; Boot lock bits - boot setcion
.equ FUSE_BLBB_RWLOCK_gc = (0x00<<6) ; Read and write not allowed
.equ FUSE_BLBB_RLOCK_gc = (0x01<<6) ; Read not allowed
.equ FUSE_BLBB_WLOCK_gc = (0x02<<6) ; Write not allowed
.equ FUSE_BLBB_NOLOCK_gc = (0x03<<6) ; No locks

; Boot lock bits - application section
.equ FUSE_BLBA_RWLOCK_gc = (0x00<<4) ; Read and write not allowed
.equ FUSE_BLBA_RLOCK_gc = (0x01<<4) ; Read not allowed
.equ FUSE_BLBA_WLOCK_gc = (0x02<<4) ; Write not allowed
.equ FUSE_BLBA_NOLOCK_gc = (0x03<<4) ; No locks

; Boot lock bits - application table section
.equ FUSE_BLBAT_RWLOCK_gc = (0x00<<2) ; Read and write not allowed
.equ FUSE_BLBAT_RLOCK_gc = (0x01<<2) ; Read not allowed
.equ FUSE_BLBAT_WLOCK_gc = (0x02<<2) ; Write not allowed
.equ FUSE_BLBAT_NOLOCK_gc = (0x03<<2) ; No locks

; Lock bits
.equ FUSE_LB_RWLOCK_gc = (0x00<<0) ; Read and write not allowed
.equ FUSE_LB_WLOCK_gc = (0x02<<0) ; Write not allowed
.equ FUSE_LB_NOLOCK_gc = (0x03<<0) ; No locks

; Boot Loader Section Reset Vector
.equ BOOTRST_BOOTLDR_gc = (0x00<<6) ; Boot Loader Reset
.equ BOOTRST_APPLICATION_gc = (0x01<<6) ; Application Reset

; BOD operation
.equ BOD_SAMPLED_gc = (0x01<<4) ; BOD enabled in sampled mode
.equ BOD_CONTINUOUS_gc = (0x02<<4) ; BOD enabled continuously
.equ BOD_DISABLED_gc = (0x03<<4) ; BOD Disabled

; Watchdog (Window) Timeout Period
.equ WD_8CLK_gc = (0x00<<0) ; 8 cycles (8ms @ 3.3V)
.equ WD_16CLK_gc = (0x01<<0) ; 16 cycles (16ms @ 3.3V)
.equ WD_32CLK_gc = (0x02<<0) ; 32 cycles (32ms @ 3.3V)
.equ WD_64CLK_gc = (0x03<<0) ; 64 cycles (64ms @ 3.3V)
.equ WD_128CLK_gc = (0x04<<0) ; 128 cycles (0.125s @ 3.3V)
.equ WD_256CLK_gc = (0x05<<0) ; 256 cycles (0.25s @ 3.3V)
.equ WD_512CLK_gc = (0x06<<0) ; 512 cycles (0.5s @ 3.3V)
.equ WD_1KCLK_gc = (0x07<<0) ; 1K cycles (1s @ 3.3V)
.equ WD_2KCLK_gc = (0x08<<0) ; 2K cycles (2s @ 3.3V)
.equ WD_4KCLK_gc = (0x09<<0) ; 4K cycles (4s @ 3.3V)
.equ WD_8KCLK_gc = (0x0A<<0) ; 8K cycles (8s @ 3.3V)

; Start-up Time
.equ SUT_0MS_gc = (0x03<<2) ; 0 ms
.equ SUT_4MS_gc = (0x01<<2) ; 4 ms
.equ SUT_64MS_gc = (0x00<<2) ; 64 ms

; Brown Out Detection Voltage Level
.equ BODLVL_1V6_gc = (0x07<<0) ; 1.6 V
.equ BODLVL_1V8_gc = (0x06<<0) ; 1.8 V
.equ BODLVL_2V0_gc = (0x05<<0) ; 2.0 V
.equ BODLVL_2V2_gc = (0x04<<0) ; 2.2 V
.equ BODLVL_2V4_gc = (0x03<<0) ; 2.4 V
.equ BODLVL_2V6_gc = (0x02<<0) ; 2.6 V
.equ BODLVL_2V8_gc = (0x01<<0) ; 2.8 V
.equ BODLVL_3V0_gc = (0x00<<0) ; 3.0 V


;*************************************************************************
;** SIGROW - Signature Row
;*************************************************************************




; ***** CPU REGISTER DEFINITIONS *****************************************
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30


; ***** DATA MEMORY DECLARATIONS *****************************************


#define PROGMEM_START 0x0000
#define PROGMEM_SIZE 0x2800
#define PROGMEM_END (0x0000 + 0x2800 - 1)

#define APP_SECTION_START 0x0000
#define APP_SECTION_SIZE 0x2000
#define APP_SECTION_END (0x0000 + 0x2000 - 1)

#define APPTABLE_SECTION_START 0x1800
#define APPTABLE_SECTION_SIZE 0x0800
#define APPTABLE_SECTION_END (0x1800 + 0x0800 - 1)

#define BOOT_SECTION_START 0x2000
#define BOOT_SECTION_SIZE 0x0800
#define BOOT_SECTION_END (0x2000 + 0x0800 - 1)

#define DATAMEM_START 0x0000
#define DATAMEM_SIZE 0x2400
#define DATAMEM_END (0x0000 + 0x2400 - 1)

#define IO_START 0x0000
#define IO_SIZE 0x1000
#define IO_END (0x0000 + 0x1000 - 1)

#define MAPPED_EEPROM_START 0x1000
#define MAPPED_EEPROM_SIZE 0x0200
#define MAPPED_EEPROM_END (0x1000 + 0x0200 - 1)

#define INTERNAL_SRAM_START 0x2000
#define INTERNAL_SRAM_SIZE 0x0400
#define INTERNAL_SRAM_END (0x2000 + 0x0400 - 1)

